----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\~Research\Cost shifting\Analysis\Logs\03 Hosp price - DMB_Results_ 3 Oct 2017.log
  log type:  text
 opened on:   3 Oct 2017, 17:03:46

. **************************************************************
. 
. *Load data
. use "$output\Reg data - all hosp price.dta", clear

. drop if balanced == 0
(1,665 observations deleted)

. 
. *set globals*
. xtset provider_number Year 
       panel variable:  provider_number (strongly balanced)
        time variable:  Year, 2010 to 2014
                delta:  1 unit

. 
. encode state, gen(st)

. gen state_abbrev = state

. drop state

. gen str5 fips_str = string(fips, "%05.0f")

. gen state_num = substr(fips_str, 1, 2)

. destring state_num, gen(state)
state_num: all characters numeric; state generated as byte

. drop state_num fips_str

. 
. global COUNTY_VARS              TotalPop Age_18to34 Age_35to64 Age_65plus Race_White Race_Black Income_50to75 ///
>                                                 Income_75to100 Income_100to150 Income_150plus Educ_HSGrad Educ_Bach 

. global HOSPITAL_VARS    teach1 teach2 System Nonprofit Profit Labor_Nurse Labor_Other ///
>                                                 Beds vbp_rebate 

. global MISSING                  m_census m_sys m_lnurse m_lother                                                                                

. global SHARE_OUTCOMES   medicaid_share medicare_share public_share other_share 

. global PRICE_OUTCOMES   pindex lnprice lnprice_hcci 

. global NOMISSING                pen_both pen_one hsa_monopoly hsa_duopoly hsa_triopoly fips_monopoly fips_duopoly fips_triopoly ///
>                                                 medicaid_share medicare_share public_share other_share pindex Profit vbp_rebate lncmi

. ********************************************************************************
. *** Table 1: Summary Statistics by whether a hospital is ever penalized
. ********************************************************************************
. qui: estpost ttest $NOMISSING , by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
pen_both            0.000        0.151        0.000
pen_one             0.000        0.201        0.000
hsa_monopoly        0.380        0.344        0.195
hsa_duopoly         0.180        0.194        0.543
hsa_triopoly        0.075        0.107        0.075
fips_monop~y        0.161        0.121        0.036
fips_duopoly        0.239        0.171        0.002
fips_triop~y        0.085        0.106        0.245
medicaid_s~e        0.120        0.126        0.298
medicare_s~e        0.361        0.331        0.000
public_share        0.480        0.457        0.001
other_share         0.520        0.543        0.001
pindex              0.576        0.603        0.000
Profit              0.016        0.200        0.000
vbp_rebate          0.161        0.196        0.129
lncmi               0.446        0.435        0.209
---------------------------------------------------
N                    8300                          
---------------------------------------------------

. 
. qui: estpost ttest fips_power1 fips_power2 fips_power fips_size , by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
fips_power1         1.159        0.987        0.008
fips_power2         1.372        1.084        0.000
fips_power          1.167        1.024        0.002
fips_size           1.485        1.514        0.325
---------------------------------------------------
N                    8300                          
---------------------------------------------------

. 
. qui: estpost ttest $COUNTY_VARS if m_census==0, by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
TotalPop          562.147     1123.431        0.000
Age_18to34          0.244        0.239        0.054
Age_35to64          0.399        0.393        0.001
Age_65plus          0.123        0.130        0.001
Race_White          0.654        0.737        0.000
Race_Black          0.245        0.135        0.000
Income_50~75        0.181        0.181        0.773
Income_7~100        0.126        0.124        0.010
Income_1~150        0.146        0.131        0.000
Income_150~s        0.117        0.099        0.000
Educ_HSGrad         0.273        0.273        0.931
Educ_Bach           0.190        0.189        0.759
---------------------------------------------------
N                    8300                          
---------------------------------------------------

. 
. qui: estpost ttest teach1 teach2 System Nonprofit if m_sys==0, by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
teach1              0.164        0.135        0.144
teach2              0.597        0.520        0.009
System              0.728        0.748        0.434
Nonprofit           0.967        0.697        0.000
---------------------------------------------------
N                    8300                          
---------------------------------------------------

. 
. qui: estpost ttest Labor_Nurse if m_lnurse==0, by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
Labor_Nurse       650.118      585.327        0.046
---------------------------------------------------
N                    8298                          
---------------------------------------------------

. 
. qui: estpost ttest Labor_Other if m_lother==0, by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
Labor_Other      1470.121     1166.277        0.000
---------------------------------------------------
N                    8295                          
---------------------------------------------------

. 
. qui: estpost ttest lnc_p_d if m_p_d==0, by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
lnc_p_d             9.976        9.940        0.069
---------------------------------------------------
N                    8255                          
---------------------------------------------------

. 
. qui: estpost ttest op_rev if m_op==0, by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
op_rev              0.483        0.501        0.017
---------------------------------------------------
N                    7278                          
---------------------------------------------------

. 
. qui: estpost ttest $PRICE_OUTCOMES if m_op==0, by(everpen)

. esttab ., cell((mu_1(fmt(3)  label(Never)) mu_2(label(Ever)) p))

---------------------------------------------------
                      (1)                          
                                                   
                    Never         Ever            p
---------------------------------------------------
pindex              0.574        0.605        0.000
lnprice             8.761        8.726        0.119
lnprice_hcci        9.245        9.285        0.068
---------------------------------------------------
N                    7278                          
---------------------------------------------------

. 
. ********************************************************************************
. *** Table 2: Demonstration of penalties and prices over time
. ********************************************************************************
. tabstat pen_none pen_one pen_both  $PRICE_OUTCOMES, by(Year) f(%5.3f)

Summary statistics: mean
  by categories of: Year 

    Year |  pen_none   pen_one  pen_both    pindex   lnprice  lnpric~i
---------+------------------------------------------------------------
    2010 |     1.000     0.000     0.000     0.600     8.750     9.219
    2011 |     1.000     0.000     0.000     0.601     8.726     9.274
    2012 |     1.000     0.000     0.000     0.602     8.716     9.321
    2013 |     0.155     0.489     0.355     0.603     8.703     9.350
    2014 |     0.149     0.480     0.371     0.603     8.744     9.397
---------+------------------------------------------------------------
   Total |     0.661     0.194     0.145     0.602     8.728     9.312
----------------------------------------------------------------------

. 
. tabstat price price_hcci, by(Year) f(%5.2f) stat(mean sd)

Summary statistics: mean, sd
  by categories of: Year 

    Year |     price  price~ci
---------+--------------------
    2010 |  10266.68  10853.77
         |   4913.29   4899.20
---------+--------------------
    2011 |  10182.00  11437.98
         |   4705.58   4942.05
---------+--------------------
    2012 |  10138.42  12035.04
         |   6272.92   5409.05
---------+--------------------
    2013 |  10065.97  12378.27
         |   4720.05   5711.30
---------+--------------------
    2014 |  10589.94  12913.11
         |   5479.52   5658.24
---------+--------------------
   Total |  10245.74  11923.63
         |   5250.31   5381.98
------------------------------

. 
. ********************************************************************************
. *** Table 3: FE models along with p-values for trends tests.
. ********************************************************************************
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one i.fips_power i.fips_size   ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6, absorb(provider_number fips) 
> cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  i.fips_power i.fips_size   ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6, absorb(provid
> er_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.004          -0.017***       -0.021***        0.021***        0.002          -0.004           0.022** 
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.018)         (0.010)   

pen_one            -0.001          -0.010***       -0.010***        0.010***       -0.001          -0.013           0.008   
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.012)         (0.007)   

1.fips_power        0.004          -0.009          -0.005           0.005          -0.005          -0.041*          0.013   
                  (0.005)         (0.006)         (0.008)         (0.008)         (0.006)         (0.021)         (0.012)   

2.fips_power       -0.008          -0.023**        -0.031**         0.031**        -0.005          -0.120***        0.010   
                  (0.009)         (0.010)         (0.013)         (0.013)         (0.007)         (0.035)         (0.016)   

2.fips_size        -0.005          -0.016***       -0.021**         0.021**         0.008**        -0.064**        -0.074** 
                  (0.006)         (0.005)         (0.009)         (0.009)         (0.004)         (0.026)         (0.036)   

TotalPop            0.000           0.000           0.000*         -0.000*         -0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.694          -0.112           0.581          -0.581           0.065           2.746          -2.691** 
                  (0.469)         (0.304)         (0.562)         (0.562)         (0.347)         (1.857)         (1.294)   

Age_35to64          0.011          -0.749**        -0.738           0.738          -0.324           2.263          -0.494   
                  (0.512)         (0.348)         (0.598)         (0.598)         (0.475)         (2.144)         (1.395)   

Age_65plus         -0.333           0.198          -0.135           0.135          -0.319           0.032          -1.823   
                  (0.509)         (0.334)         (0.589)         (0.589)         (0.416)         (2.061)         (1.189)   

Race_White         -0.227**        -0.088*         -0.315***        0.315***        0.044           0.048          -0.385*  
                  (0.103)         (0.051)         (0.112)         (0.112)         (0.062)         (0.363)         (0.221)   

Race_Black          0.866***       -0.161           0.706**        -0.706**         0.149          -0.467          -1.057   
                  (0.273)         (0.174)         (0.318)         (0.318)         (0.189)         (1.353)         (0.766)   

Income_50~75       -0.093          -0.131          -0.225           0.225          -0.256*         -0.839          -0.319   
                  (0.174)         (0.108)         (0.205)         (0.205)         (0.149)         (0.701)         (0.398)   

Income_7~100        0.079          -0.112          -0.033           0.033          -0.395***        0.742          -0.788   
                  (0.211)         (0.130)         (0.238)         (0.238)         (0.138)         (0.810)         (0.510)   

Income_1~150       -0.202           0.044          -0.159           0.159          -0.070          -0.115          -1.037** 
                  (0.183)         (0.137)         (0.222)         (0.222)         (0.136)         (0.719)         (0.480)   

Income_150~s       -0.158           0.403***        0.246          -0.246           0.007           1.605**         1.357***
                  (0.182)         (0.121)         (0.208)         (0.208)         (0.148)         (0.756)         (0.452)   

Educ_HSGrad        -0.189          -0.120          -0.309           0.309           0.166          -0.073           0.470   
                  (0.184)         (0.112)         (0.208)         (0.208)         (0.123)         (0.719)         (0.366)   

Educ_Bach           0.080          -0.419**        -0.340           0.340           0.206          -1.346           0.170   
                  (0.240)         (0.185)         (0.284)         (0.284)         (0.165)         (1.053)         (0.532)   

teach1             -0.001           0.004           0.003          -0.003          -0.003          -0.086*         -0.018   
                  (0.014)         (0.004)         (0.014)         (0.014)         (0.006)         (0.052)         (0.016)   

teach2              0.004          -0.001           0.004          -0.004          -0.002          -0.015           0.014*  
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

System              0.000          -0.004          -0.004           0.004           0.006*          0.005           0.031   
                  (0.004)         (0.004)         (0.006)         (0.006)         (0.004)         (0.023)         (0.021)   

Nonprofit           0.011          -0.011          -0.001           0.001          -0.001           0.024           0.036   
                  (0.011)         (0.009)         (0.011)         (0.011)         (0.005)         (0.071)         (0.059)   

Profit              0.001          -0.015*         -0.013           0.013          -0.007           0.072           0.081   
                  (0.012)         (0.009)         (0.013)         (0.013)         (0.006)         (0.072)         (0.073)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000*         -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.002          -0.010***       -0.012***        0.012***       -0.000           0.005           0.004   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.002)         (0.013)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000          -0.020          -0.020           0.020          -0.025          -0.001          -0.190*  
                  (0.015)         (0.014)         (0.026)         (0.026)         (0.048)         (0.098)         (0.106)   

m_lother            0.027*         -0.009           0.018          -0.018           0.034           0.087           0.038   
                  (0.014)         (0.011)         (0.025)         (0.025)         (0.048)         (0.098)         (0.055)   

m_p_d               0.004          -0.001           0.002          -0.002          -0.020**         0.000           0.022   
                  (0.005)         (0.009)         (0.012)         (0.012)         (0.009)             (.)         (0.044)   

m_op                0.002          -0.001           0.001          -0.001          -0.004           0.000           0.016   
                  (0.005)         (0.002)         (0.006)         (0.006)         (0.004)             (.)         (0.012)   

y2                 -0.006***       -0.004***       -0.010***        0.010***        0.001          -0.035***        0.054***
                  (0.002)         (0.001)         (0.003)         (0.003)         (0.002)         (0.009)         (0.005)   

y3                 -0.012***       -0.010***       -0.022***        0.022***        0.002          -0.050***        0.102***
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.003)         (0.014)         (0.008)   

y4                 -0.013*         -0.001          -0.014*          0.014*          0.003          -0.060**         0.114***
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.004)         (0.024)         (0.014)   

y5                 -0.018**        -0.006          -0.024**         0.024**         0.003          -0.020           0.160***
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.005)         (0.030)         (0.017)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    8297            8297            8297            8297            8007            7205            8297   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  y2 y3 y4 y5 y6 evY2 evY3 evY4 evY5 evY6   i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS}  m_*, abs
> orb(provider_number fips) cluster(provider_number)
  3. est sto h_trend_`y'
  4. qui: test evY2 evY3 evY4 evY5 evY6
  5. scalar `y'_penalty=r(p)
  6. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  y2 y3 y4 y5 y6 evY2 evY3 evY4 evY5 evY6    i.fips_power i.fips_size ${PRICE_VARS} ${COUNTY_VARS} ${HOSPITAL_
> VARS}  m_*, absorb(provider_number fips) cluster(provider_number)
  3. est sto h_trend_`y'
  4. qui: test evY2 evY3 evY4 evY5 evY6
  5. scalar `y'_penalty=r(p)
  6. }

. esttab h_trend_medicaid_share h_trend_medicare_share h_trend_public_share h_trend_other_share h_trend_pindex h_trend_lnprice h_trend_lnprice_hcci,
>  b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01)

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.000          -0.011***       -0.012*          0.012*          0.001          -0.004           0.015   
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.019)         (0.011)   

pen_one             0.002          -0.006**        -0.004           0.004          -0.001          -0.013           0.003   
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.013)         (0.007)   

y2                 -0.003          -0.008**        -0.011           0.011           0.002          -0.058*          0.057***
                  (0.005)         (0.004)         (0.007)         (0.007)         (0.003)         (0.032)         (0.011)   

y3                 -0.002          -0.009**        -0.011           0.011           0.000          -0.109***        0.064***
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.005)         (0.030)         (0.015)   

y4                  0.003          -0.000           0.003          -0.003          -0.001          -0.116***        0.089***
                  (0.010)         (0.007)         (0.011)         (0.011)         (0.006)         (0.039)         (0.022)   

y5                 -0.008           0.013*          0.005          -0.005           0.001          -0.023           0.130***
                  (0.010)         (0.007)         (0.012)         (0.012)         (0.008)         (0.042)         (0.025)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

evY2               -0.003           0.005           0.002          -0.002          -0.002           0.023          -0.004   
                  (0.005)         (0.003)         (0.007)         (0.007)         (0.003)         (0.031)         (0.011)   

evY3               -0.010*         -0.001          -0.012           0.012           0.002           0.061**         0.039***
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.028)         (0.014)   

evY4               -0.019**        -0.006          -0.025**         0.025**         0.006           0.057           0.032   
                  (0.009)         (0.006)         (0.010)         (0.010)         (0.006)         (0.036)         (0.021)   

evY5               -0.014          -0.024***       -0.038***        0.038***        0.002           0.002           0.037*  
                  (0.009)         (0.006)         (0.010)         (0.010)         (0.007)         (0.036)         (0.021)   

evY6                0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

1.fips_power        0.004          -0.009          -0.005           0.005          -0.005          -0.040*          0.013   
                  (0.005)         (0.006)         (0.008)         (0.008)         (0.006)         (0.021)         (0.012)   

2.fips_power       -0.008          -0.024**        -0.031**         0.031**        -0.005          -0.120***        0.009   
                  (0.008)         (0.010)         (0.013)         (0.013)         (0.007)         (0.035)         (0.016)   

2.fips_size        -0.005          -0.016***       -0.020**         0.020**         0.008**        -0.064**        -0.076** 
                  (0.006)         (0.005)         (0.009)         (0.009)         (0.004)         (0.026)         (0.036)   

TotalPop            0.000           0.000           0.000*         -0.000*         -0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.611          -0.184           0.427          -0.427           0.090           2.925          -2.503*  
                  (0.472)         (0.305)         (0.564)         (0.564)         (0.347)         (1.860)         (1.296)   

Age_35to64         -0.051          -0.800**        -0.851           0.851          -0.304           2.376          -0.365   
                  (0.512)         (0.349)         (0.598)         (0.598)         (0.476)         (2.142)         (1.399)   

Age_65plus         -0.369           0.177          -0.193           0.193          -0.308           0.121          -1.739   
                  (0.510)         (0.334)         (0.588)         (0.588)         (0.416)         (2.061)         (1.186)   

Race_White         -0.216**        -0.081          -0.297***        0.297***        0.041           0.019          -0.411*  
                  (0.103)         (0.052)         (0.112)         (0.112)         (0.062)         (0.364)         (0.223)   

Race_Black          0.883***       -0.141           0.742**        -0.742**         0.144          -0.489          -1.099   
                  (0.275)         (0.173)         (0.319)         (0.319)         (0.190)         (1.355)         (0.766)   

Income_50~75       -0.106          -0.151          -0.257           0.257          -0.252*         -0.827          -0.285   
                  (0.175)         (0.108)         (0.205)         (0.205)         (0.149)         (0.702)         (0.398)   

Income_7~100        0.082          -0.118          -0.036           0.036          -0.396***        0.713          -0.796   
                  (0.212)         (0.131)         (0.239)         (0.239)         (0.138)         (0.813)         (0.512)   

Income_1~150       -0.216           0.046          -0.170           0.170          -0.066          -0.059          -1.013** 
                  (0.183)         (0.137)         (0.222)         (0.222)         (0.136)         (0.721)         (0.482)   

Income_150~s       -0.178           0.379***        0.201          -0.201           0.013           1.638**         1.410***
                  (0.182)         (0.122)         (0.208)         (0.208)         (0.148)         (0.756)         (0.453)   

Educ_HSGrad        -0.218          -0.142          -0.360*          0.360*          0.174           0.014           0.543   
                  (0.185)         (0.112)         (0.210)         (0.210)         (0.124)         (0.721)         (0.367)   

Educ_Bach           0.072          -0.419**        -0.348           0.348           0.208          -1.305           0.192   
                  (0.240)         (0.184)         (0.283)         (0.283)         (0.166)         (1.054)         (0.532)   

teach1             -0.001           0.005           0.004          -0.004          -0.003          -0.084          -0.019   
                  (0.014)         (0.004)         (0.014)         (0.014)         (0.006)         (0.052)         (0.016)   

teach2              0.004          -0.000           0.004          -0.004          -0.001          -0.015           0.014*  
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

System              0.000          -0.004          -0.003           0.003           0.006*          0.006           0.030   
                  (0.004)         (0.004)         (0.006)         (0.006)         (0.004)         (0.023)         (0.021)   

Nonprofit           0.011          -0.012          -0.001           0.001          -0.001           0.023           0.036   
                  (0.011)         (0.009)         (0.011)         (0.011)         (0.005)         (0.071)         (0.059)   

Profit              0.002          -0.015*         -0.013           0.013          -0.008           0.071           0.080   
                  (0.012)         (0.009)         (0.013)         (0.013)         (0.006)         (0.072)         (0.073)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000*         -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.000          -0.007***       -0.008*          0.008*         -0.001           0.006           0.001   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.002)         (0.013)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse           -0.000          -0.020          -0.020           0.020          -0.025          -0.000          -0.190*  
                  (0.015)         (0.014)         (0.026)         (0.026)         (0.049)         (0.098)         (0.106)   

m_lother            0.027*         -0.009           0.018          -0.018           0.034           0.089           0.039   
                  (0.014)         (0.011)         (0.025)         (0.025)         (0.048)         (0.098)         (0.056)   

m_p_d               0.004          -0.001           0.003          -0.003          -0.020**         0.000           0.021   
                  (0.005)         (0.009)         (0.012)         (0.012)         (0.009)             (.)         (0.044)   

m_op                0.002          -0.001           0.001          -0.001          -0.004           0.000           0.016   
                  (0.005)         (0.002)         (0.006)         (0.006)         (0.004)             (.)         (0.012)   
----------------------------------------------------------------------------------------------------------------------------
N                    8297            8297            8297            8297            8007            7205            8297   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. foreach y of varlist $SHARE_OUTCOMES $PRICE_OUTCOMES {
  2. scalar list `y'_penalty
  3. }
medicaid_share_penalty =  .24037907
medicare_share_penalty =  .00007221
public_share_penalty =  .00660639
other_share_penalty =   .0066064
pindex_penalty =  .73636567
lnprice_penalty =  .19505452
lnprice_hcci_penalty =  .00025638

. est clear

. scalar drop _all

. 
. **** Different types of Fixed Effects
. * None
. foreach y of global SHARE_OUTCOMES{
  2. qui: reg `y' pen_both pen_one i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6, cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reg `y' pen_both pen_one  i.fips_power i.fips_size   ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6, cluster(provider_
> number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both            0.002          -0.007          -0.005           0.005           0.005          -0.097***       -0.062** 
                  (0.008)         (0.008)         (0.010)         (0.010)         (0.008)         (0.031)         (0.028)   

pen_one             0.003          -0.003          -0.000           0.000           0.006          -0.050**        -0.024   
                  (0.005)         (0.006)         (0.007)         (0.007)         (0.006)         (0.022)         (0.019)   

0.fips_power        0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

1.fips_power        0.008           0.002           0.010          -0.010           0.017**        -0.064***        0.008   
                  (0.006)         (0.006)         (0.007)         (0.007)         (0.007)         (0.024)         (0.023)   

2.fips_power        0.010           0.016**         0.026***       -0.026***        0.012          -0.176***        0.017   
                  (0.008)         (0.008)         (0.010)         (0.010)         (0.010)         (0.033)         (0.031)   

1.fips_size         0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

2.fips_size        -0.010*         -0.029***       -0.040***        0.040***       -0.004          -0.124***       -0.112***
                  (0.006)         (0.006)         (0.007)         (0.007)         (0.007)         (0.024)         (0.024)   

TotalPop            0.000**         0.000           0.000***       -0.000***        0.000*         -0.000***       -0.000***
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34         -0.147           0.455***        0.308**        -0.308**        -0.472***        1.404***        0.893** 
                  (0.097)         (0.094)         (0.121)         (0.121)         (0.107)         (0.396)         (0.381)   

Age_35to64         -0.122           0.400***        0.278*         -0.278*         -0.488***        1.612***        1.416***
                  (0.124)         (0.140)         (0.168)         (0.168)         (0.160)         (0.520)         (0.485)   

Age_65plus         -0.113           0.901***        0.788***       -0.788***       -0.218**         0.611*          1.280***
                  (0.087)         (0.088)         (0.097)         (0.097)         (0.108)         (0.338)         (0.335)   

Race_White         -0.008           0.202***        0.194***       -0.194***       -0.044          -1.003***       -1.213***
                  (0.036)         (0.039)         (0.043)         (0.043)         (0.043)         (0.143)         (0.181)   

Race_Black          0.012           0.272***        0.284***       -0.284***       -0.060          -1.173***       -1.551***
                  (0.040)         (0.038)         (0.046)         (0.046)         (0.041)         (0.135)         (0.173)   

Income_50~75       -0.190          -0.595***       -0.785***        0.785***        0.771***        0.748           0.868   
                  (0.212)         (0.180)         (0.232)         (0.232)         (0.228)         (0.755)         (0.709)   

Income_7~100        0.753**         0.352           1.106***       -1.106***       -1.114***        3.040***        0.094   
                  (0.294)         (0.233)         (0.333)         (0.333)         (0.312)         (1.009)         (0.944)   

Income_1~150       -0.606***        0.299*         -0.308           0.308           0.041          -1.069          -0.621   
                  (0.182)         (0.165)         (0.218)         (0.218)         (0.213)         (0.746)         (0.674)   

Income_150~s       -0.101           0.133           0.032          -0.032          -0.037           0.653           0.291   
                  (0.100)         (0.101)         (0.122)         (0.122)         (0.128)         (0.429)         (0.421)   

Educ_HSGrad        -0.464***       -0.091          -0.555***        0.555***        0.027          -0.483*         -1.815***
                  (0.074)         (0.078)         (0.096)         (0.096)         (0.081)         (0.288)         (0.327)   

Educ_Bach          -0.310***       -0.424***       -0.733***        0.733***        0.316***        0.002          -1.422***
                  (0.098)         (0.094)         (0.118)         (0.118)         (0.099)         (0.362)         (0.386)   

teach1              0.025***       -0.031***       -0.006           0.006          -0.023***       -0.009           0.052*  
                  (0.009)         (0.007)         (0.010)         (0.010)         (0.007)         (0.035)         (0.028)   

teach2              0.010**        -0.012***       -0.002           0.002          -0.017***       -0.028*         -0.007   
                  (0.004)         (0.004)         (0.005)         (0.005)         (0.005)         (0.016)         (0.016)   

System             -0.013**         0.003          -0.009           0.009           0.002           0.065***        0.100***
                  (0.005)         (0.005)         (0.006)         (0.006)         (0.005)         (0.021)         (0.020)   

Nonprofit          -0.044***        0.038***       -0.006           0.006          -0.002           0.098***        0.042   
                  (0.008)         (0.007)         (0.008)         (0.008)         (0.007)         (0.034)         (0.031)   

Profit             -0.038***        0.024***       -0.014           0.014           0.031***        0.141***        0.079** 
                  (0.009)         (0.009)         (0.010)         (0.010)         (0.009)         (0.038)         (0.037)   

Labor_Nurse         0.000          -0.000***       -0.000**         0.000**         0.000***        0.000***        0.000***
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000***        0.000***       -0.000***       -0.000***        0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000          -0.000          -0.000           0.000           0.000          -0.000          -0.000***
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.014**         0.008          -0.006           0.006           0.004          -0.008           0.029   
                  (0.006)         (0.005)         (0.007)         (0.007)         (0.006)         (0.023)         (0.019)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse           -0.077           0.040          -0.038           0.038          -0.020          -0.533***        0.043   
                  (0.102)         (0.043)         (0.075)         (0.075)         (0.093)         (0.100)         (0.221)   

m_lother            0.120          -0.092**         0.028          -0.028           0.011           0.337***       -0.129   
                  (0.099)         (0.040)         (0.073)         (0.073)         (0.072)         (0.067)         (0.172)   

m_p_d              -0.073***        0.036          -0.037           0.037           0.033*          0.000           0.171** 
                  (0.022)         (0.023)         (0.031)         (0.031)         (0.019)             (.)         (0.084)   

m_op               -0.016**        -0.006          -0.023***        0.023***        0.003           0.000           0.175***
                  (0.007)         (0.007)         (0.009)         (0.009)         (0.007)             (.)         (0.028)   

y2                 -0.004***       -0.005***       -0.010***        0.010***        0.002**        -0.024***        0.049***
                  (0.001)         (0.001)         (0.002)         (0.002)         (0.001)         (0.005)         (0.003)   

y3                 -0.008***       -0.013***       -0.021***        0.021***        0.003**        -0.032***        0.087***
                  (0.002)         (0.001)         (0.002)         (0.002)         (0.002)         (0.007)         (0.005)   

y4                 -0.005          -0.020***       -0.025***        0.025***       -0.003           0.016           0.124***
                  (0.008)         (0.007)         (0.010)         (0.010)         (0.007)         (0.028)         (0.025)   

y5                 -0.009          -0.021***       -0.031***        0.031***       -0.002           0.060**         0.166***
                  (0.008)         (0.007)         (0.010)         (0.010)         (0.008)         (0.028)         (0.025)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

_cons               0.486***       -0.116           0.370***        0.630***        0.899***        8.230***        9.992***
                  (0.085)         (0.083)         (0.106)         (0.106)         (0.097)         (0.339)         (0.326)   
----------------------------------------------------------------------------------------------------------------------------
N                    8300            8300            8300            8300            8010            7227            8300   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. * Just Hospital
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6, absorb(provider_number) cluste
> r(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  i.fips_power i.fips_size   ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6, absorb(provid
> er_number) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.003          -0.017***       -0.020***        0.020***        0.002          -0.002           0.022** 
                  (0.005)         (0.003)         (0.005)         (0.005)         (0.003)         (0.017)         (0.009)   

pen_one             0.000          -0.010***       -0.009***        0.009***       -0.001          -0.012           0.008   
                  (0.003)         (0.002)         (0.003)         (0.003)         (0.002)         (0.011)         (0.006)   

1.fips_power        0.005          -0.009          -0.004           0.004          -0.005          -0.040**         0.013   
                  (0.005)         (0.006)         (0.008)         (0.008)         (0.006)         (0.020)         (0.012)   

2.fips_power       -0.005          -0.022**        -0.027**         0.027**        -0.005          -0.112***        0.009   
                  (0.008)         (0.010)         (0.012)         (0.012)         (0.007)         (0.033)         (0.016)   

2.fips_size        -0.008          -0.017***       -0.024***        0.024***        0.007*         -0.067***       -0.073** 
                  (0.006)         (0.005)         (0.009)         (0.009)         (0.003)         (0.024)         (0.034)   

TotalPop            0.000           0.000           0.000          -0.000          -0.000*          0.000**         0.000*  
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34         -0.066          -0.035          -0.102           0.102          -0.298           2.677**        -0.944   
                  (0.305)         (0.203)         (0.344)         (0.344)         (0.249)         (1.286)         (0.880)   

Age_35to64         -0.012          -0.517*         -0.530           0.530          -0.492           3.458*          0.247   
                  (0.443)         (0.286)         (0.522)         (0.522)         (0.380)         (1.806)         (1.255)   

Age_65plus         -0.017           0.276           0.259          -0.259          -0.379           1.336          -1.043   
                  (0.408)         (0.231)         (0.445)         (0.445)         (0.280)         (1.431)         (1.037)   

Race_White         -0.229**        -0.076*         -0.306***        0.306***        0.010           0.136          -0.359*  
                  (0.095)         (0.046)         (0.102)         (0.102)         (0.058)         (0.329)         (0.201)   

Race_Black          0.173          -0.226**        -0.053           0.053          -0.114          -0.616          -0.414   
                  (0.163)         (0.100)         (0.192)         (0.192)         (0.119)         (0.593)         (0.350)   

Income_50~75       -0.005          -0.120          -0.125           0.125          -0.235*         -0.694          -0.357   
                  (0.164)         (0.102)         (0.192)         (0.192)         (0.137)         (0.650)         (0.381)   

Income_7~100        0.139          -0.094           0.045          -0.045          -0.400***        0.904          -0.811*  
                  (0.203)         (0.122)         (0.229)         (0.229)         (0.127)         (0.752)         (0.488)   

Income_1~150       -0.094           0.044          -0.050           0.050          -0.061          -0.065          -1.185***
                  (0.175)         (0.128)         (0.215)         (0.215)         (0.124)         (0.672)         (0.452)   

Income_150~s       -0.055           0.423***        0.367**        -0.367**        -0.008           1.744***        1.099***
                  (0.165)         (0.103)         (0.184)         (0.184)         (0.125)         (0.644)         (0.387)   

Educ_HSGrad        -0.159          -0.097          -0.256           0.256           0.134           0.017           0.423   
                  (0.164)         (0.106)         (0.185)         (0.185)         (0.108)         (0.667)         (0.340)   

Educ_Bach           0.072          -0.422***       -0.350           0.350           0.245*         -1.553*          0.053   
                  (0.204)         (0.158)         (0.234)         (0.234)         (0.145)         (0.884)         (0.443)   

teach1             -0.002           0.004           0.002          -0.002          -0.003          -0.089*         -0.017   
                  (0.013)         (0.004)         (0.013)         (0.013)         (0.006)         (0.050)         (0.015)   

teach2              0.005          -0.000           0.004          -0.004          -0.001          -0.015           0.013*  
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

System              0.001          -0.005          -0.004           0.004           0.006*          0.004           0.030   
                  (0.004)         (0.004)         (0.006)         (0.006)         (0.003)         (0.022)         (0.021)   

Nonprofit           0.012          -0.011           0.001          -0.001          -0.001           0.027           0.035   
                  (0.010)         (0.008)         (0.010)         (0.010)         (0.005)         (0.068)         (0.056)   

Profit              0.002          -0.014*         -0.012           0.012          -0.007           0.074           0.079   
                  (0.011)         (0.008)         (0.012)         (0.012)         (0.005)         (0.069)         (0.070)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000**        -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.002          -0.010***       -0.012***        0.012***       -0.000           0.005           0.004   
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.012)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.004          -0.021          -0.017           0.017          -0.025           0.003          -0.193*  
                  (0.015)         (0.014)         (0.026)         (0.026)         (0.046)         (0.089)         (0.102)   

m_lother            0.027*         -0.009           0.018          -0.018           0.034           0.088           0.036   
                  (0.014)         (0.011)         (0.024)         (0.024)         (0.046)         (0.089)         (0.053)   

m_p_d               0.004          -0.001           0.003          -0.003          -0.020**         0.000           0.025   
                  (0.004)         (0.009)         (0.012)         (0.012)         (0.009)             (.)         (0.042)   

m_op                0.002          -0.001           0.001          -0.001          -0.004           0.000           0.017   
                  (0.005)         (0.002)         (0.005)         (0.005)         (0.004)             (.)         (0.011)   

y2                 -0.006***       -0.004***       -0.010***        0.010***        0.001          -0.036***        0.053***
                  (0.002)         (0.001)         (0.002)         (0.002)         (0.001)         (0.008)         (0.004)   

y3                 -0.012***       -0.010***       -0.021***        0.021***        0.003          -0.050***        0.100***
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

y4                 -0.013**        -0.000          -0.014**         0.014**         0.003          -0.062***        0.111***
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.020)         (0.012)   

y5                 -0.019***       -0.005          -0.024***        0.024***        0.003          -0.020           0.157***
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.005)         (0.024)         (0.015)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    8300            8300            8300            8300            8010            7209            8300   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. * Hospital and State
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one i.fips_power i.fips_size   ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6, absorb(provider_number st) cl
> uster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  i.fips_power i.fips_size   ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6, absorb(provid
> er_number state) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.003          -0.017***       -0.020***        0.020***        0.002          -0.002           0.022** 
                  (0.005)         (0.003)         (0.005)         (0.005)         (0.003)         (0.017)         (0.009)   

pen_one             0.000          -0.010***       -0.009***        0.009***       -0.001          -0.012           0.008   
                  (0.003)         (0.002)         (0.003)         (0.003)         (0.002)         (0.011)         (0.006)   

1.fips_power        0.005          -0.009          -0.004           0.004          -0.005          -0.040*          0.013   
                  (0.005)         (0.006)         (0.008)         (0.008)         (0.006)         (0.020)         (0.012)   

2.fips_power       -0.005          -0.022**        -0.027**         0.027**        -0.005          -0.112***        0.009   
                  (0.008)         (0.010)         (0.012)         (0.012)         (0.007)         (0.033)         (0.016)   

2.fips_size        -0.008          -0.017***       -0.024***        0.024***        0.007*         -0.067***       -0.073** 
                  (0.006)         (0.005)         (0.009)         (0.009)         (0.003)         (0.025)         (0.034)   

TotalPop            0.000           0.000           0.000          -0.000          -0.000*          0.000**         0.000*  
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34         -0.066          -0.035          -0.102           0.102          -0.298           2.677**        -0.944   
                  (0.306)         (0.204)         (0.345)         (0.345)         (0.249)         (1.290)         (0.883)   

Age_35to64         -0.012          -0.517*         -0.530           0.530          -0.492           3.458*          0.247   
                  (0.445)         (0.287)         (0.523)         (0.523)         (0.381)         (1.812)         (1.259)   

Age_65plus         -0.017           0.276           0.259          -0.259          -0.379           1.336          -1.043   
                  (0.409)         (0.232)         (0.446)         (0.446)         (0.281)         (1.436)         (1.040)   

Race_White         -0.229**        -0.076          -0.306***        0.306***        0.010           0.136          -0.359*  
                  (0.095)         (0.047)         (0.103)         (0.103)         (0.058)         (0.330)         (0.202)   

Race_Black          0.173          -0.226**        -0.053           0.053          -0.114          -0.616          -0.414   
                  (0.163)         (0.100)         (0.192)         (0.192)         (0.119)         (0.595)         (0.351)   

Income_50~75       -0.005          -0.120          -0.125           0.125          -0.235*         -0.694          -0.357   
                  (0.165)         (0.102)         (0.193)         (0.193)         (0.138)         (0.652)         (0.382)   

Income_7~100        0.139          -0.094           0.045          -0.045          -0.400***        0.904          -0.811*  
                  (0.204)         (0.122)         (0.230)         (0.230)         (0.128)         (0.754)         (0.490)   

Income_1~150       -0.094           0.044          -0.050           0.050          -0.061          -0.065          -1.185***
                  (0.176)         (0.128)         (0.216)         (0.216)         (0.125)         (0.674)         (0.453)   

Income_150~s       -0.055           0.423***        0.367**        -0.367**        -0.008           1.744***        1.099***
                  (0.165)         (0.103)         (0.185)         (0.185)         (0.125)         (0.646)         (0.388)   

Educ_HSGrad        -0.159          -0.097          -0.256           0.256           0.134           0.017           0.423   
                  (0.164)         (0.106)         (0.185)         (0.185)         (0.108)         (0.669)         (0.341)   

Educ_Bach           0.072          -0.422***       -0.350           0.350           0.245*         -1.553*          0.053   
                  (0.205)         (0.159)         (0.235)         (0.235)         (0.145)         (0.886)         (0.444)   

teach1             -0.002           0.004           0.002          -0.002          -0.003          -0.089*         -0.017   
                  (0.013)         (0.004)         (0.013)         (0.013)         (0.006)         (0.050)         (0.015)   

teach2              0.005          -0.000           0.004          -0.004          -0.001          -0.015           0.013*  
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

System              0.001          -0.005          -0.004           0.004           0.006*          0.004           0.030   
                  (0.004)         (0.004)         (0.006)         (0.006)         (0.003)         (0.022)         (0.021)   

Nonprofit           0.012          -0.011           0.001          -0.001          -0.001           0.027           0.035   
                  (0.010)         (0.008)         (0.010)         (0.010)         (0.005)         (0.068)         (0.057)   

Profit              0.002          -0.014*         -0.012           0.012          -0.007           0.074           0.079   
                  (0.011)         (0.008)         (0.012)         (0.012)         (0.005)         (0.070)         (0.070)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000**        -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.002          -0.010***       -0.012***        0.012***       -0.000           0.005           0.004   
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.012)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.004          -0.021          -0.017           0.017          -0.025           0.003          -0.193*  
                  (0.015)         (0.014)         (0.026)         (0.026)         (0.046)         (0.090)         (0.102)   

m_lother            0.027*         -0.009           0.018          -0.018           0.034           0.088           0.036   
                  (0.014)         (0.011)         (0.024)         (0.024)         (0.046)         (0.090)         (0.053)   

m_p_d               0.004          -0.001           0.003          -0.003          -0.020**         0.000           0.025   
                  (0.004)         (0.009)         (0.012)         (0.012)         (0.009)             (.)         (0.042)   

m_op                0.002          -0.001           0.001          -0.001          -0.004           0.000           0.017   
                  (0.005)         (0.002)         (0.005)         (0.005)         (0.004)             (.)         (0.012)   

y2                 -0.006***       -0.004***       -0.010***        0.010***        0.001          -0.036***        0.053***
                  (0.002)         (0.001)         (0.002)         (0.002)         (0.001)         (0.008)         (0.004)   

y3                 -0.012***       -0.010***       -0.021***        0.021***        0.003          -0.050***        0.100***
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

y4                 -0.013**        -0.000          -0.014**         0.014**         0.003          -0.062***        0.111***
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.021)         (0.012)   

y5                 -0.019***       -0.005          -0.024***        0.024***        0.003          -0.020           0.157***
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.005)         (0.024)         (0.015)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    8300            8300            8300            8300            8010            7209            8300   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. ********************************************************************************
. *** Table 4: FE models by for profit status with p-values for trends tests
. ********************************************************************************
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} m_* y2 y3 y4 y5 y6  if any_forprofit==0, absorb(p
> rovider_number fips) cluster(provider_number)
  3. est store h_`y'_nfp
  4. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} m_* y2 y3 y4 y5 y6  if any_forprofit==1, absorb(p
> rovider_number fips) cluster(provider_number)
  5. est store h_`y'_fp
  6. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6 if any_forprof
> it==0, absorb(provider_number fips) cluster(provider_number)
  3. est store h_`y'_nfp
  4. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6 if any_forprof
> it==1, absorb(provider_number fips) cluster(provider_number)
  5. est store h_`y'_fp
  6. }

. esttab h_medicaid_share_nfp h_medicare_share_nfp h_public_share_nfp h_other_share_nfp h_pindex_nfp h_lnprice_nfp h_lnprice_hcci_nfp, title("Nonpro
> fit Hospitals") b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 

Nonprofit Hospitals
----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.005          -0.014***       -0.020***        0.020***        0.003           0.002           0.025** 
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.019)         (0.010)   

pen_one             0.000          -0.009***       -0.008**         0.008**        -0.001          -0.008           0.013*  
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.013)         (0.007)   

1.fips_power        0.003          -0.012          -0.009           0.009          -0.009          -0.052**         0.010   
                  (0.006)         (0.009)         (0.011)         (0.011)         (0.007)         (0.026)         (0.014)   

2.fips_power       -0.004          -0.028**        -0.032*          0.032*         -0.007          -0.109**         0.003   
                  (0.010)         (0.013)         (0.017)         (0.017)         (0.008)         (0.045)         (0.018)   

2.fips_size        -0.006          -0.019***       -0.025**         0.025**         0.006          -0.055*         -0.055   
                  (0.008)         (0.006)         (0.011)         (0.011)         (0.004)         (0.030)         (0.035)   

TotalPop            0.000           0.000           0.000          -0.000          -0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.654          -0.008           0.646          -0.646           0.026           1.212          -0.668   
                  (0.541)         (0.364)         (0.663)         (0.663)         (0.393)         (2.094)         (1.318)   

Age_35to64         -0.053          -0.971**        -1.024           1.024          -0.324           0.217           1.363   
                  (0.576)         (0.399)         (0.688)         (0.688)         (0.552)         (2.364)         (1.422)   

Age_65plus         -0.668           0.419          -0.249           0.249          -0.271           0.003          -0.168   
                  (0.591)         (0.366)         (0.685)         (0.685)         (0.471)         (2.308)         (1.210)   

Race_White         -0.210*         -0.092          -0.302**         0.302**         0.077          -0.641          -0.457*  
                  (0.116)         (0.067)         (0.132)         (0.132)         (0.074)         (0.446)         (0.234)   

Race_Black          0.929***       -0.170           0.759**        -0.759**         0.298          -1.773          -1.322   
                  (0.326)         (0.207)         (0.386)         (0.386)         (0.223)         (1.647)         (0.843)   

Income_50~75       -0.121          -0.108          -0.229           0.229          -0.213          -0.447          -0.490   
                  (0.201)         (0.125)         (0.238)         (0.238)         (0.168)         (0.789)         (0.435)   

Income_7~100        0.047          -0.022           0.025          -0.025          -0.350**         0.440          -0.616   
                  (0.247)         (0.139)         (0.272)         (0.272)         (0.148)         (0.929)         (0.543)   

Income_1~150       -0.310           0.125          -0.185           0.185           0.069          -0.527          -1.553***
                  (0.206)         (0.164)         (0.260)         (0.260)         (0.149)         (0.822)         (0.512)   

Income_150~s       -0.242           0.370**         0.128          -0.128          -0.044           1.214           1.558***
                  (0.210)         (0.144)         (0.243)         (0.243)         (0.165)         (0.882)         (0.486)   

Educ_HSGrad        -0.126          -0.028          -0.154           0.154           0.286**        -0.036           0.383   
                  (0.217)         (0.130)         (0.250)         (0.250)         (0.139)         (0.822)         (0.409)   

Educ_Bach           0.261          -0.524**        -0.262           0.262           0.225          -1.989           0.247   
                  (0.271)         (0.215)         (0.330)         (0.330)         (0.177)         (1.241)         (0.571)   

teach1              0.000           0.004           0.005          -0.005          -0.003          -0.093*         -0.024   
                  (0.014)         (0.004)         (0.014)         (0.014)         (0.006)         (0.053)         (0.016)   

teach2              0.003          -0.001           0.002          -0.002          -0.004          -0.023*          0.009   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.002)         (0.012)         (0.008)   

System              0.001          -0.006          -0.005           0.005           0.007*         -0.016           0.024   
                  (0.005)         (0.004)         (0.006)         (0.006)         (0.004)         (0.022)         (0.023)   

Nonprofit           0.013          -0.009           0.004          -0.004          -0.000          -0.036           0.004   
                  (0.012)         (0.011)         (0.014)         (0.014)         (0.007)         (0.090)         (0.046)   

Profit              0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000*         -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000**        -0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.003          -0.008***       -0.011**         0.011**         0.001           0.012           0.008   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.002)         (0.014)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse           -0.008          -0.029**        -0.037           0.037           0.030*          0.038          -0.139   
                  (0.020)         (0.014)         (0.031)         (0.031)         (0.016)         (0.125)         (0.105)   

m_lother            0.034*         -0.000           0.033          -0.033          -0.022           0.046          -0.008   
                  (0.019)         (0.012)         (0.031)         (0.031)         (0.015)         (0.127)         (0.059)   

m_p_d               0.003           0.001           0.004          -0.004          -0.019**         0.000           0.010   
                  (0.005)         (0.010)         (0.014)         (0.014)         (0.010)             (.)         (0.045)   

m_op                0.002          -0.001           0.001          -0.001          -0.002           0.000           0.024*  
                  (0.006)         (0.003)         (0.007)         (0.007)         (0.003)             (.)         (0.014)   

y2                 -0.005**        -0.004***       -0.010***        0.010***        0.002          -0.024**         0.046***
                  (0.002)         (0.002)         (0.003)         (0.003)         (0.002)         (0.011)         (0.005)   

y3                 -0.011***       -0.010***       -0.021***        0.021***        0.003          -0.033**         0.083***
                  (0.004)         (0.003)         (0.005)         (0.005)         (0.003)         (0.017)         (0.009)   

y4                 -0.010          -0.003          -0.013           0.013           0.004          -0.053*          0.089***
                  (0.007)         (0.005)         (0.009)         (0.009)         (0.005)         (0.028)         (0.015)   

y5                 -0.013          -0.009          -0.022**         0.022**         0.004          -0.012           0.133***
                  (0.009)         (0.006)         (0.011)         (0.011)         (0.006)         (0.035)         (0.018)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    6552            6552            6552            6552            6477            5596            6552   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. esttab h_medicaid_share_fp h_medicare_share_fp h_public_share_fp h_other_share_fp h_pindex_nfp h_lnprice_fp h_lnprice_hcci_fp, title("For-profit H
> ospitals") b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 

For-profit Hospitals
----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both            0.006          -0.021*         -0.015           0.015           0.003           0.000          -0.011   
                  (0.016)         (0.011)         (0.020)         (0.020)         (0.003)         (0.040)         (0.034)   

pen_one            -0.003          -0.011***       -0.014           0.014          -0.001          -0.023          -0.017   
                  (0.010)         (0.004)         (0.010)         (0.010)         (0.002)         (0.027)         (0.019)   

1.fips_power        0.007          -0.001           0.006          -0.006          -0.009           0.022           0.032   
                  (0.008)         (0.006)         (0.009)         (0.009)         (0.007)         (0.038)         (0.033)   

2.fips_power       -0.018          -0.007          -0.025           0.025          -0.007          -0.107**         0.053   
                  (0.014)         (0.014)         (0.018)         (0.018)         (0.008)         (0.054)         (0.044)   

2.fips_size        -0.002          -0.007          -0.009           0.009           0.006          -0.079          -0.147   
                  (0.006)         (0.006)         (0.008)         (0.008)         (0.004)         (0.050)         (0.104)   

TotalPop            0.000           0.000           0.000          -0.000          -0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          1.265          -0.615           0.651          -0.651           0.026           6.539          -8.704** 
                  (1.005)         (0.576)         (1.114)         (1.114)         (0.393)         (4.442)         (3.662)   

Age_35to64          0.773          -0.367           0.406          -0.406          -0.324           6.595          -6.478   
                  (1.224)         (0.739)         (1.299)         (1.299)         (0.552)         (5.043)         (4.064)   

Age_65plus          1.230          -0.393           0.837          -0.837          -0.271           1.084          -7.764** 
                  (1.069)         (0.798)         (1.229)         (1.229)         (0.471)         (4.237)         (3.535)   

Race_White         -0.278          -0.033          -0.311           0.311           0.077           1.510**        -0.453   
                  (0.211)         (0.078)         (0.219)         (0.219)         (0.074)         (0.605)         (0.508)   

Race_Black          0.813*         -0.056           0.757          -0.757           0.298           3.862*          0.005   
                  (0.492)         (0.327)         (0.515)         (0.515)         (0.223)         (2.023)         (1.808)   

Income_50~75       -0.021          -0.154          -0.175           0.175          -0.213          -2.124          -0.159   
                  (0.385)         (0.226)         (0.432)         (0.432)         (0.168)         (1.486)         (1.046)   

Income_7~100        0.311          -0.382          -0.071           0.071          -0.350**         2.291          -1.188   
                  (0.446)         (0.343)         (0.522)         (0.522)         (0.148)         (1.690)         (1.407)   

Income_1~150        0.271          -0.257           0.015          -0.015           0.069           1.365           0.959   
                  (0.389)         (0.206)         (0.407)         (0.407)         (0.149)         (1.524)         (1.295)   

Income_150~s        0.156           0.495**         0.651          -0.651          -0.044           1.936           1.155   
                  (0.397)         (0.239)         (0.419)         (0.419)         (0.165)         (1.530)         (1.209)   

Educ_HSGrad        -0.390          -0.389*         -0.780**         0.780**         0.286**        -0.386           0.539   
                  (0.347)         (0.236)         (0.365)         (0.365)         (0.139)         (1.499)         (0.923)   

Educ_Bach          -0.506          -0.084          -0.590           0.590           0.225           0.779          -0.096   
                  (0.540)         (0.362)         (0.558)         (0.558)         (0.177)         (1.988)         (1.491)   

teach1             -0.054***        0.010*         -0.044***        0.044***       -0.003           0.219***        0.091***
                  (0.010)         (0.006)         (0.011)         (0.011)         (0.006)         (0.036)         (0.030)   

teach2              0.010           0.001           0.010          -0.010          -0.004           0.013           0.032*  
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.002)         (0.026)         (0.019)   

System             -0.011           0.008          -0.003           0.003           0.007*          0.167*          0.080   
                  (0.012)         (0.010)         (0.016)         (0.016)         (0.004)         (0.091)         (0.081)   

Nonprofit           0.003          -0.018          -0.015           0.015          -0.000           0.185**         0.115   
                  (0.024)         (0.012)         (0.022)         (0.022)         (0.007)         (0.088)         (0.172)   

Profit             -0.003          -0.020*         -0.022           0.022           0.000           0.195***        0.122   
                  (0.024)         (0.010)         (0.020)         (0.020)             (.)         (0.074)         (0.154)   

Labor_Nurse        -0.000           0.000           0.000          -0.000          -0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds                0.000          -0.000           0.000          -0.000           0.000**         0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate          0.006          -0.012          -0.006           0.006           0.001           0.004          -0.028   
                  (0.012)         (0.009)         (0.016)         (0.016)         (0.002)         (0.028)         (0.029)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000           0.000           0.000           0.000           0.030*          0.000           0.000   
                      (.)             (.)             (.)             (.)         (0.016)             (.)             (.)   

m_lother            0.009          -0.020**        -0.011           0.011          -0.022           0.122**         0.119***
                  (0.014)         (0.009)         (0.015)         (0.015)         (0.015)         (0.051)         (0.036)   

m_p_d               0.008          -0.013**        -0.005           0.005          -0.019**         0.000           0.123***
                  (0.008)         (0.006)         (0.010)         (0.010)         (0.010)             (.)         (0.043)   

m_op                0.002          -0.006          -0.004           0.004          -0.002           0.000          -0.014   
                  (0.008)         (0.005)         (0.010)         (0.010)         (0.003)             (.)         (0.022)   

y2                 -0.009*         -0.001          -0.010*          0.010*          0.002          -0.068***        0.074***
                  (0.005)         (0.002)         (0.005)         (0.005)         (0.002)         (0.017)         (0.013)   

y3                 -0.016*         -0.009**        -0.025***        0.025***        0.003          -0.101***        0.163***
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.003)         (0.027)         (0.022)   

y4                 -0.030           0.003          -0.027           0.027           0.004          -0.108**         0.218***
                  (0.019)         (0.010)         (0.021)         (0.021)         (0.005)         (0.054)         (0.039)   

y5                 -0.046**         0.001          -0.044*          0.044*          0.004          -0.070           0.265***
                  (0.022)         (0.013)         (0.024)         (0.024)         (0.006)         (0.064)         (0.046)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    1744            1744            1744            1744            6477            1608            1744   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  y2 y3 y4 y5 y6 evY2 evY3 evY4 evY5 evY6   i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS}  m_* if a
> ny_forprofit==0, absorb(provider_number fips) cluster(provider_number)
  3. est store th_`y'_nfp
  4. qui: test evY2 evY3 evY4 evY5 evY6
  5. scalar `y'_penalty_nfp=r(p)
  6. qui: reghdfe `y' pen_both pen_one  y2 y3 y4 y5 y6 evY2 evY3 evY4 evY5 evY6   i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS}  m_* if a
> ny_forprofit==1, absorb(provider_number fips) cluster(provider_number)
  7. est store th_`y'_fp
  8. qui: test evY2 evY3 evY4 evY5 evY6
  9. scalar `y'_penalty_fp=r(p)
 10. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  y2 y3 y4 y5 y6 evY2 evY3 evY4 evY5 evY6   i.fips_power i.fips_size ${PRICE_VARS} ${COUNTY_VARS} ${HOSPITAL_V
> ARS}  m_* if any_forprofit==0, absorb(provider_number fips) cluster(provider_number)
  3. est store th_`y'_nfp
  4. qui: test evY2 evY3 evY4 evY5 evY6
  5. scalar `y'_penalty_nfp=r(p)
  6. qui: reghdfe `y' pen_both pen_one  y2 y3 y4 y5 y6 evY2 evY3 evY4 evY5 evY6   i.fips_power i.fips_size ${PRICE_VARS} ${COUNTY_VARS} ${HOSPITAL_V
> ARS}  m_* if any_forprofit==1, absorb(provider_number fips) cluster(provider_number)
  7. est store th_`y'_fp
  8. qui: test evY2 evY3 evY4 evY5 evY6
  9. scalar `y'_penalty_fp=r(p)
 10. }

. esttab th_medicaid_share_nfp th_medicare_share_nfp th_public_share_nfp th_other_share_nfp th_pindex_nfp th_lnprice_nfp th_lnprice_hcci_nfp, title(
> "Nonprofit Hospitals") b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 

Nonprofit Hospitals
----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.001          -0.008**        -0.009           0.009           0.001           0.002           0.019*  
                  (0.006)         (0.004)         (0.006)         (0.006)         (0.004)         (0.021)         (0.011)   

pen_one             0.004          -0.004          -0.000           0.000          -0.002          -0.008           0.009   
                  (0.004)         (0.003)         (0.004)         (0.004)         (0.003)         (0.014)         (0.008)   

y2                 -0.002          -0.010***       -0.012*          0.012*          0.004          -0.051           0.054***
                  (0.006)         (0.003)         (0.007)         (0.007)         (0.003)         (0.033)         (0.011)   

y3                  0.001          -0.011**        -0.010           0.010           0.002          -0.100***        0.057***
                  (0.007)         (0.005)         (0.008)         (0.008)         (0.005)         (0.032)         (0.016)   

y4                  0.006          -0.003           0.003          -0.003          -0.001          -0.112***        0.074***
                  (0.010)         (0.007)         (0.012)         (0.012)         (0.006)         (0.041)         (0.023)   

y5                 -0.003           0.009           0.006          -0.006           0.003          -0.019           0.114***
                  (0.011)         (0.007)         (0.013)         (0.013)         (0.008)         (0.045)         (0.025)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

evY2               -0.004           0.006**         0.003          -0.003          -0.002           0.028          -0.009   
                  (0.005)         (0.003)         (0.007)         (0.007)         (0.003)         (0.031)         (0.011)   

evY3               -0.012*          0.001          -0.011           0.011           0.001           0.069**         0.027*  
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.028)         (0.014)   

evY4               -0.021**        -0.006          -0.027**         0.027**         0.006           0.062*          0.021   
                  (0.009)         (0.006)         (0.011)         (0.011)         (0.006)         (0.037)         (0.021)   

evY5               -0.014          -0.025***       -0.039***        0.039***        0.003           0.006           0.025   
                  (0.009)         (0.006)         (0.011)         (0.011)         (0.007)         (0.037)         (0.021)   

evY6                0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

1.fips_power        0.003          -0.012          -0.009           0.009          -0.009          -0.051**         0.011   
                  (0.006)         (0.009)         (0.011)         (0.011)         (0.007)         (0.026)         (0.014)   

2.fips_power       -0.004          -0.028**        -0.032*          0.032*         -0.007          -0.110**         0.003   
                  (0.010)         (0.013)         (0.017)         (0.017)         (0.008)         (0.044)         (0.018)   

2.fips_size        -0.006          -0.018***       -0.024**         0.024**         0.006          -0.056*         -0.056   
                  (0.008)         (0.006)         (0.011)         (0.011)         (0.004)         (0.030)         (0.035)   

TotalPop            0.000           0.000*          0.000*         -0.000*         -0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.557          -0.089           0.468          -0.468           0.055           1.441          -0.523   
                  (0.545)         (0.365)         (0.665)         (0.665)         (0.393)         (2.096)         (1.320)   

Age_35to64         -0.130          -1.037***       -1.168*          1.168*         -0.298           0.357           1.469   
                  (0.577)         (0.399)         (0.688)         (0.688)         (0.554)         (2.358)         (1.426)   

Age_65plus         -0.710           0.398          -0.312           0.312          -0.260           0.115          -0.105   
                  (0.592)         (0.366)         (0.685)         (0.685)         (0.472)         (2.306)         (1.206)   

Race_White         -0.194*         -0.081          -0.276**         0.276**         0.073          -0.681          -0.481** 
                  (0.117)         (0.067)         (0.132)         (0.132)         (0.074)         (0.447)         (0.235)   

Race_Black          0.954***       -0.141           0.813**        -0.813**         0.291          -1.808          -1.364   
                  (0.328)         (0.206)         (0.387)         (0.387)         (0.223)         (1.651)         (0.845)   

Income_50~75       -0.138          -0.134          -0.272           0.272          -0.208          -0.428          -0.458   
                  (0.201)         (0.125)         (0.239)         (0.239)         (0.169)         (0.791)         (0.435)   

Income_7~100        0.050          -0.035           0.015          -0.015          -0.350**         0.398          -0.617   
                  (0.248)         (0.139)         (0.274)         (0.274)         (0.148)         (0.932)         (0.545)   

Income_1~150       -0.331           0.123          -0.208           0.208           0.074          -0.455          -1.529***
                  (0.206)         (0.164)         (0.260)         (0.260)         (0.149)         (0.826)         (0.514)   

Income_150~s       -0.269           0.337**         0.068          -0.068          -0.036           1.251           1.603***
                  (0.211)         (0.144)         (0.243)         (0.243)         (0.166)         (0.882)         (0.489)   

Educ_HSGrad        -0.164          -0.053          -0.217           0.217           0.295**         0.088           0.444   
                  (0.219)         (0.130)         (0.253)         (0.253)         (0.140)         (0.827)         (0.410)   

Educ_Bach           0.252          -0.520**        -0.268           0.268           0.227          -1.936           0.260   
                  (0.271)         (0.214)         (0.328)         (0.328)         (0.177)         (1.243)         (0.572)   

teach1              0.001           0.005           0.006          -0.006          -0.003          -0.091*         -0.024   
                  (0.014)         (0.004)         (0.014)         (0.014)         (0.006)         (0.053)         (0.017)   

teach2              0.003          -0.001           0.002          -0.002          -0.004          -0.023*          0.009   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.002)         (0.012)         (0.008)   

System              0.001          -0.006          -0.004           0.004           0.007*         -0.016           0.024   
                  (0.005)         (0.004)         (0.006)         (0.006)         (0.004)         (0.022)         (0.023)   

Nonprofit           0.013          -0.009           0.004          -0.004          -0.000          -0.038           0.004   
                  (0.012)         (0.011)         (0.014)         (0.014)         (0.007)         (0.090)         (0.046)   

Profit              0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000*         -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000**        -0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.001          -0.006**        -0.006           0.006           0.001           0.013           0.005   
                  (0.004)         (0.002)         (0.005)         (0.005)         (0.002)         (0.014)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse           -0.008          -0.030**        -0.038           0.038           0.030*          0.038          -0.139   
                  (0.019)         (0.013)         (0.030)         (0.030)         (0.016)         (0.125)         (0.105)   

m_lother            0.034*          0.001           0.034          -0.034          -0.022           0.050          -0.008   
                  (0.019)         (0.011)         (0.029)         (0.029)         (0.015)         (0.127)         (0.060)   

m_p_d               0.004           0.001           0.005          -0.005          -0.019**         0.000           0.009   
                  (0.005)         (0.010)         (0.014)         (0.014)         (0.010)             (.)         (0.045)   

m_op                0.002          -0.001           0.001          -0.001          -0.002           0.000           0.024*  
                  (0.006)         (0.003)         (0.006)         (0.006)         (0.003)             (.)         (0.014)   
----------------------------------------------------------------------------------------------------------------------------
N                    6552            6552            6552            6552            6477            5596            6552   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. esttab th_medicaid_share_fp th_medicare_share_fp th_public_share_fp th_other_share_fp th_pindex_fp th_lnprice_fp th_lnprice_hcci_fp, title("For-pr
> ofit Hospitals") b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 

For-profit Hospitals
----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both            0.007          -0.021*         -0.014           0.014          -0.001           0.000          -0.015   
                  (0.017)         (0.012)         (0.021)         (0.021)         (0.008)         (0.040)         (0.036)   

pen_one            -0.003          -0.011***       -0.013           0.013           0.002          -0.023          -0.019   
                  (0.010)         (0.004)         (0.010)         (0.010)         (0.005)         (0.027)         (0.019)   

y2                  0.005           0.137***        0.143***       -0.143***       -0.060***       -0.068***        0.002   
                  (0.011)         (0.008)         (0.012)         (0.012)         (0.017)         (0.017)         (0.104)   

y3                  0.007           0.082***        0.089***       -0.089***       -0.062***       -0.101***       -0.002   
                  (0.013)         (0.008)         (0.013)         (0.013)         (0.018)         (0.027)         (0.101)   

y4                 -0.003           0.065***        0.062***       -0.062***       -0.057***       -0.108**         0.240** 
                  (0.020)         (0.014)         (0.023)         (0.023)         (0.020)         (0.054)         (0.111)   

y5                 -0.006           0.065***        0.059*         -0.059*         -0.058**        -0.070           0.097   
                  (0.027)         (0.018)         (0.030)         (0.030)         (0.029)         (0.064)         (0.111)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

evY2               -0.014          -0.138***       -0.153***        0.153***        0.059***        0.000           0.073   
                  (0.011)         (0.007)         (0.012)         (0.012)         (0.017)             (.)         (0.103)   

evY3               -0.023*         -0.092***       -0.115***        0.115***        0.063***        0.000           0.165   
                  (0.012)         (0.008)         (0.013)         (0.013)         (0.017)             (.)         (0.104)   

evY4               -0.028*         -0.062***       -0.090***        0.090***        0.060***        0.000          -0.018   
                  (0.017)         (0.009)         (0.017)         (0.017)         (0.019)             (.)         (0.103)   

evY5               -0.041          -0.064***       -0.105***        0.105***        0.059**         0.000           0.173   
                  (0.033)         (0.021)         (0.038)         (0.038)         (0.028)             (.)         (0.108)   

evY6                0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

1.fips_power        0.008           0.002           0.010          -0.010           0.007           0.022           0.027   
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.015)         (0.038)         (0.033)   

2.fips_power       -0.017          -0.004          -0.021           0.021           0.002          -0.107**         0.047   
                  (0.014)         (0.014)         (0.017)         (0.017)         (0.017)         (0.054)         (0.044)   

2.fips_size        -0.001          -0.003          -0.004           0.004           0.012*         -0.079          -0.152   
                  (0.006)         (0.005)         (0.007)         (0.007)         (0.007)         (0.050)         (0.106)   

TotalPop            0.000           0.000           0.000          -0.000          -0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          1.246          -0.595           0.651          -0.651           0.221           6.539          -8.643** 
                  (1.007)         (0.577)         (1.119)         (1.119)         (0.774)         (4.442)         (3.689)   

Age_35to64          0.745          -0.357           0.388          -0.388          -0.337           6.595          -6.371   
                  (1.225)         (0.741)         (1.303)         (1.303)         (0.949)         (5.043)         (4.087)   

Age_65plus          1.219          -0.380           0.840          -0.840          -0.333           1.084          -7.723** 
                  (1.068)         (0.798)         (1.229)         (1.229)         (0.928)         (4.237)         (3.551)   

Race_White         -0.283          -0.030          -0.313           0.313           0.030           1.510**        -0.436   
                  (0.213)         (0.078)         (0.220)         (0.220)         (0.108)         (0.605)         (0.512)   

Race_Black          0.815*         -0.052           0.763          -0.763          -0.286           3.862*         -0.002   
                  (0.493)         (0.326)         (0.517)         (0.517)         (0.330)         (2.023)         (1.809)   

Income_50~75       -0.020          -0.143          -0.163           0.163          -0.194          -2.124          -0.165   
                  (0.386)         (0.226)         (0.432)         (0.432)         (0.334)         (1.486)         (1.048)   

Income_7~100        0.331          -0.361          -0.030           0.030          -0.449           2.291          -1.276   
                  (0.452)         (0.346)         (0.529)         (0.529)         (0.371)         (1.690)         (1.423)   

Income_1~150        0.288          -0.260           0.028          -0.028          -0.724**         1.365           0.899   
                  (0.390)         (0.207)         (0.408)         (0.408)         (0.321)         (1.524)         (1.302)   

Income_150~s        0.157           0.512**         0.669          -0.669           0.292           1.936           1.142   
                  (0.398)         (0.239)         (0.419)         (0.419)         (0.360)         (1.530)         (1.205)   

Educ_HSGrad        -0.399          -0.388          -0.787**         0.787**        -0.071          -0.386           0.575   
                  (0.350)         (0.236)         (0.368)         (0.368)         (0.258)         (1.499)         (0.929)   

Educ_Bach          -0.514          -0.085          -0.599           0.599           0.084           0.779          -0.061   
                  (0.541)         (0.362)         (0.559)         (0.559)         (0.455)         (1.988)         (1.498)   

teach1             -0.054***        0.010*         -0.044***        0.044***       -0.010           0.219***        0.091***
                  (0.010)         (0.006)         (0.011)         (0.011)         (0.006)         (0.036)         (0.031)   

teach2              0.010           0.001           0.011          -0.011           0.006           0.013           0.031   
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.005)         (0.026)         (0.019)   

System             -0.009           0.009          -0.000           0.000          -0.003           0.167*          0.073   
                  (0.013)         (0.011)         (0.017)         (0.017)         (0.012)         (0.091)         (0.085)   

Nonprofit           0.002          -0.018          -0.015           0.015          -0.004           0.185**         0.116   
                  (0.024)         (0.012)         (0.022)         (0.022)         (0.009)         (0.088)         (0.171)   

Profit             -0.003          -0.019*         -0.022           0.022          -0.008           0.195***        0.123   
                  (0.024)         (0.010)         (0.020)         (0.020)         (0.008)         (0.074)         (0.153)   

Labor_Nurse        -0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000          -0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds                0.000          -0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate          0.007          -0.012          -0.006           0.006          -0.009           0.004          -0.030   
                  (0.012)         (0.010)         (0.016)         (0.016)         (0.006)         (0.028)         (0.029)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lother            0.008          -0.020**        -0.012           0.012           0.144***        0.122**         0.121***
                  (0.014)         (0.009)         (0.016)         (0.016)         (0.012)         (0.051)         (0.037)   

m_p_d               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_op                0.002          -0.006          -0.004           0.004          -0.014           0.000          -0.013   
                  (0.008)         (0.005)         (0.010)         (0.010)         (0.017)             (.)         (0.022)   
----------------------------------------------------------------------------------------------------------------------------
N                    1744            1744            1744            1744            1529            1608            1744   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. foreach y of varlist $SHARE_OUTCOMES $PRICE_OUTCOMES {
  2. scalar list `y'_penalty_nfp `y'_penalty_fp
  3. }
medicaid_share_penalty_nfp =  .16859407
medicaid_share_penalty_fp =  .37793417
medicare_share_penalty_nfp =  6.182e-06
medicare_share_penalty_fp =  1.055e-80
public_share_penalty_nfp =  .00702911
public_share_penalty_fp =  5.279e-38
other_share_penalty_nfp =  .00702912
other_share_penalty_fp =  5.278e-38
pindex_penalty_nfp =  .66639736
pindex_penalty_fp =  .00334012
lnprice_penalty_nfp =   .1265019
lnprice_penalty_fp =          .
lnprice_hcci_penalty_nfp =  .00580215
lnprice_hcci_penalty_fp =  1.068e-33

. est clear

. scalar drop _all

. ********************************************************************************
. *** Table 5: DDD Estimators                                                                                     
. ********************************************************************************
. ** First by Market Share for the small markets
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_one##i.fips_power1 pen_both##i.fips_power1 ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6 if fips_power1~=., absorb(p
> rovider_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_one##i.fips_power1 pen_both##i.fips_power1   ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6  if fips_p
> ower1~=., absorb(provider_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
1.pen_one           0.004          -0.008          -0.004           0.004          -0.001          -0.004           0.003   
                  (0.005)         (0.005)         (0.007)         (0.007)         (0.005)         (0.019)         (0.012)   

1.fips_pow~1       -0.009          -0.020**        -0.029***        0.029***       -0.005          -0.052*          0.009   
                  (0.007)         (0.009)         (0.011)         (0.011)         (0.005)         (0.029)         (0.013)   

2.fips_pow~1       -0.006          -0.016*         -0.022*          0.022*         -0.007          -0.064*          0.030   
                  (0.009)         (0.009)         (0.012)         (0.012)         (0.007)         (0.037)         (0.020)   

1.pen_one#~1        0.001          -0.001           0.000          -0.000          -0.002           0.024           0.001   
                  (0.006)         (0.005)         (0.007)         (0.007)         (0.004)         (0.022)         (0.013)   

1.pen_one#~1       -0.003          -0.001          -0.003           0.003           0.003          -0.003           0.012   
                  (0.006)         (0.005)         (0.008)         (0.008)         (0.005)         (0.023)         (0.013)   

1.pen_both         -0.003          -0.016***       -0.018*          0.018*          0.002          -0.008           0.004   
                  (0.008)         (0.006)         (0.010)         (0.010)         (0.006)         (0.028)         (0.016)   

1.pen_both~1       -0.001           0.001          -0.000           0.000          -0.002           0.017          -0.015   
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.006)         (0.026)         (0.016)   

1.pen_both~1       -0.009           0.003          -0.006           0.006           0.002          -0.004          -0.011   
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.006)         (0.029)         (0.016)   

TotalPop            0.001***        0.000           0.001***       -0.001***       -0.000*          0.000           0.001*  
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.001)         (0.000)   

Age_18to34          0.593           0.077           0.670          -0.670          -0.055           3.224          -0.157   
                  (0.629)         (0.512)         (0.785)         (0.785)         (0.484)         (2.757)         (1.391)   

Age_35to64         -0.658          -0.440          -1.098           1.098          -0.415           1.779           1.508   
                  (0.683)         (0.545)         (0.844)         (0.844)         (0.659)         (2.941)         (1.564)   

Age_65plus          0.105           0.214           0.319          -0.319          -0.335           0.344           3.145***
                  (0.666)         (0.463)         (0.773)         (0.773)         (0.585)         (2.533)         (1.188)   

Race_White         -0.082          -0.087          -0.169           0.169           0.086           0.537          -0.249   
                  (0.182)         (0.091)         (0.190)         (0.190)         (0.098)         (0.542)         (0.310)   

Race_Black          0.789**        -0.475           0.314          -0.314           0.220          -0.876           0.181   
                  (0.373)         (0.300)         (0.471)         (0.471)         (0.289)         (1.961)         (1.036)   

Income_50~75        0.047          -0.165          -0.118           0.118          -0.375**        -0.329           0.194   
                  (0.197)         (0.125)         (0.226)         (0.226)         (0.172)         (0.794)         (0.449)   

Income_7~100        0.237          -0.200           0.037          -0.037          -0.525***        0.941          -0.375   
                  (0.248)         (0.160)         (0.276)         (0.276)         (0.154)         (0.959)         (0.567)   

Income_1~150        0.194           0.051           0.245          -0.245          -0.232           0.370          -0.180   
                  (0.230)         (0.187)         (0.277)         (0.277)         (0.166)         (0.854)         (0.571)   

Income_150~s       -0.224           0.393**         0.168          -0.168          -0.257           2.374**         1.006*  
                  (0.246)         (0.191)         (0.291)         (0.291)         (0.178)         (1.020)         (0.557)   

Educ_HSGrad        -0.079          -0.013          -0.092           0.092           0.203           0.480           0.234   
                  (0.212)         (0.135)         (0.239)         (0.239)         (0.145)         (0.823)         (0.398)   

Educ_Bach           0.248          -0.494**        -0.246           0.246           0.356**        -1.020          -0.298   
                  (0.285)         (0.230)         (0.341)         (0.341)         (0.178)         (1.174)         (0.566)   

teach1              0.020           0.013           0.033          -0.033           0.003           0.155*          0.036   
                  (0.017)         (0.013)         (0.021)         (0.021)         (0.005)         (0.082)         (0.026)   

teach2              0.001           0.000           0.002          -0.002          -0.004          -0.018           0.009   
                  (0.005)         (0.003)         (0.005)         (0.005)         (0.003)         (0.014)         (0.010)   

System             -0.002          -0.006          -0.008           0.008           0.007           0.031           0.012   
                  (0.008)         (0.008)         (0.011)         (0.011)         (0.005)         (0.030)         (0.018)   

Nonprofit           0.019*         -0.016           0.003          -0.003          -0.000          -0.099          -0.027   
                  (0.011)         (0.014)         (0.015)         (0.015)         (0.007)         (0.070)         (0.039)   

Profit              0.003          -0.019          -0.016           0.016          -0.007          -0.071          -0.016   
                  (0.013)         (0.015)         (0.018)         (0.018)         (0.008)         (0.095)         (0.037)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000          -0.000          -0.000           0.000          -0.000          -0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.002          -0.008**        -0.010*          0.010*          0.001           0.009          -0.009   
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.018)         (0.009)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.037***       -0.004           0.033*         -0.033*         -0.069           0.035          -0.141   
                  (0.012)         (0.013)         (0.017)         (0.017)         (0.053)         (0.114)         (0.113)   

m_lother            0.001          -0.025***       -0.024**         0.024**         0.075           0.054           0.031   
                  (0.009)         (0.008)         (0.011)         (0.011)         (0.053)         (0.112)         (0.065)   

m_p_d               0.009**        -0.035***       -0.026***        0.026***       -0.008**         0.000           0.171***
                  (0.004)         (0.003)         (0.005)         (0.005)         (0.003)             (.)         (0.010)   

m_op               -0.007          -0.001          -0.008           0.008           0.003           0.000           0.006   
                  (0.007)         (0.003)         (0.007)         (0.007)         (0.006)             (.)         (0.023)   

y2                 -0.009***       -0.003          -0.012***        0.012***        0.003          -0.042***        0.035***
                  (0.003)         (0.002)         (0.003)         (0.003)         (0.002)         (0.012)         (0.006)   

y3                 -0.019***       -0.009***       -0.028***        0.028***        0.004          -0.057***        0.063***
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.019)         (0.010)   

y4                 -0.026***       -0.001          -0.027**         0.027**         0.006          -0.077**         0.078***
                  (0.009)         (0.006)         (0.010)         (0.010)         (0.006)         (0.031)         (0.016)   

y5                 -0.032***       -0.004          -0.037***        0.037***        0.007          -0.034           0.109***
                  (0.011)         (0.007)         (0.013)         (0.013)         (0.007)         (0.038)         (0.020)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    4014            4014            4014            4014            3893            3796            4014   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. ** Market Share for the big markets
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_one##i.fips_power2 pen_both##i.fips_power2 ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6 if fips_power2~=., absorb(p
> rovider_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_one##i.fips_power2 pen_both##i.fips_power2   ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6  if fips_p
> ower2~=., absorb(provider_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
1.pen_one          -0.008          -0.013***       -0.021***        0.021***        0.003          -0.084***       -0.004   
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.005)         (0.023)         (0.015)   

1.fips_pow~2       -0.007          -0.003          -0.011           0.011           0.004          -0.001          -0.004   
                  (0.006)         (0.004)         (0.008)         (0.008)         (0.006)         (0.025)         (0.019)   

2.fips_pow~2       -0.009          -0.022***       -0.031***        0.031***        0.008          -0.119***       -0.008   
                  (0.009)         (0.006)         (0.011)         (0.011)         (0.009)         (0.039)         (0.023)   

1.pen_one#~2        0.006          -0.000           0.005          -0.005          -0.003           0.039           0.008   
                  (0.006)         (0.003)         (0.006)         (0.006)         (0.005)         (0.024)         (0.016)   

1.pen_one#~2        0.004           0.004           0.007          -0.007          -0.005           0.069***        0.008   
                  (0.006)         (0.003)         (0.007)         (0.007)         (0.005)         (0.023)         (0.014)   

1.pen_both         -0.007          -0.017***       -0.024**         0.024**         0.000          -0.045           0.030   
                  (0.008)         (0.006)         (0.010)         (0.010)         (0.005)         (0.031)         (0.021)   

1.pen_both~2       -0.001          -0.004          -0.004           0.004           0.004           0.006          -0.008   
                  (0.007)         (0.003)         (0.008)         (0.008)         (0.005)         (0.027)         (0.018)   

1.pen_both~2        0.007          -0.001           0.006          -0.006          -0.000           0.031           0.001   
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.028)         (0.018)   

TotalPop           -0.000           0.000***        0.000          -0.000          -0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.580          -0.428           0.152          -0.152           0.047           2.074          -6.214***
                  (0.710)         (0.400)         (0.821)         (0.821)         (0.568)         (2.965)         (2.233)   

Age_35to64          0.682          -1.588***       -0.905           0.905           0.307           1.872          -6.472***
                  (0.842)         (0.489)         (0.951)         (0.951)         (0.686)         (3.762)         (2.340)   

Age_65plus         -1.050          -0.514          -1.564           1.564          -0.596          -2.212          -7.040***
                  (0.858)         (0.533)         (0.998)         (0.998)         (0.675)         (4.466)         (2.622)   

Race_White         -0.217*         -0.133**        -0.350**         0.350**         0.024          -0.105          -0.211   
                  (0.129)         (0.062)         (0.145)         (0.145)         (0.093)         (0.488)         (0.278)   

Race_Black          1.118***       -0.123           0.995**        -0.995**         0.314          -0.030          -0.397   
                  (0.389)         (0.210)         (0.441)         (0.441)         (0.297)         (1.728)         (0.952)   

Income_50~75        0.189           0.023           0.211          -0.211          -0.008          -3.828**        -0.876   
                  (0.419)         (0.240)         (0.484)         (0.484)         (0.312)         (1.701)         (0.972)   

Income_7~100        0.062           0.286           0.348          -0.348          -0.357           0.383          -2.357** 
                  (0.469)         (0.228)         (0.518)         (0.518)         (0.370)         (1.706)         (1.102)   

Income_1~150       -0.986**        -0.466**        -1.452***        1.452***        0.308          -2.283          -2.201** 
                  (0.394)         (0.229)         (0.443)         (0.443)         (0.270)         (1.643)         (1.006)   

Income_150~s       -0.067           0.200           0.133          -0.133           0.527**        -0.150           0.517   
                  (0.282)         (0.152)         (0.314)         (0.314)         (0.252)         (1.180)         (0.753)   

Educ_HSGrad        -0.359          -0.239          -0.599           0.599          -0.049          -2.042           2.309***
                  (0.358)         (0.210)         (0.409)         (0.409)         (0.259)         (1.561)         (0.873)   

Educ_Bach           0.172           0.058           0.229          -0.229          -0.527          -1.173           2.514** 
                  (0.436)         (0.269)         (0.489)         (0.489)         (0.442)         (2.247)         (1.231)   

teach1             -0.006           0.000          -0.006           0.006          -0.004          -0.157***       -0.031*  
                  (0.017)         (0.003)         (0.016)         (0.016)         (0.007)         (0.050)         (0.018)   

teach2              0.006          -0.001           0.006          -0.006           0.000          -0.007           0.023** 
                  (0.005)         (0.002)         (0.005)         (0.005)         (0.003)         (0.016)         (0.011)   

System             -0.000          -0.002          -0.002           0.002           0.005          -0.036           0.004   
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.005)         (0.034)         (0.018)   

Nonprofit          -0.006          -0.006          -0.012           0.012          -0.005           0.161           0.034   
                  (0.020)         (0.009)         (0.016)         (0.016)         (0.007)         (0.105)         (0.060)   

Profit             -0.008          -0.007          -0.015           0.015          -0.012*          0.183*          0.079   
                  (0.022)         (0.009)         (0.018)         (0.018)         (0.007)         (0.095)         (0.057)   

Labor_Nurse         0.000           0.000           0.000*         -0.000*          0.000           0.000**        -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000**         0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.002          -0.010***       -0.012*          0.012*         -0.003          -0.006           0.006   
                  (0.005)         (0.004)         (0.007)         (0.007)         (0.003)         (0.019)         (0.012)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lother            0.058***        0.017***        0.075***       -0.075***       -0.033***        0.231***        0.057***
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.005)         (0.052)         (0.020)   

m_p_d               0.001           0.007           0.008          -0.008          -0.024**         0.000          -0.002   
                  (0.006)         (0.009)         (0.013)         (0.013)         (0.011)             (.)         (0.047)   

m_op                0.005          -0.002           0.003          -0.003          -0.007           0.000           0.007   
                  (0.007)         (0.003)         (0.007)         (0.007)         (0.005)             (.)         (0.011)   

y2                 -0.004          -0.001          -0.005           0.005          -0.002          -0.024           0.081***
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.003)         (0.016)         (0.010)   

y3                 -0.006          -0.006          -0.012*          0.012*          0.001          -0.045*          0.144***
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.005)         (0.027)         (0.017)   

y4                  0.000           0.006           0.006          -0.006           0.004          -0.024           0.171***
                  (0.010)         (0.007)         (0.012)         (0.012)         (0.008)         (0.046)         (0.028)   

y5                 -0.005           0.001          -0.004           0.004           0.003           0.014           0.226***
                  (0.013)         (0.008)         (0.015)         (0.015)         (0.010)         (0.059)         (0.035)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    4221            4221            4221            4221            4054            3353            4221   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. 
. ** Second, by payer mix, following Wu(2010)
. xtile psper=public_share, n(4)

. tab psper, gen(ps)

4 quantiles |
         of |
public_shar |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,075       25.00       25.00
          2 |      2,075       25.00       50.00
          3 |      2,075       25.00       75.00
          4 |      2,075       25.00      100.00
------------+-----------------------------------
      Total |      8,300      100.00

. for num 2/4: gen ps_oneX=psX*pen_one

->  gen ps_one2=ps2*pen_one

->  gen ps_one3=ps3*pen_one

->  gen ps_one4=ps4*pen_one

. for num 2/4: gen ps_bothX=psX*pen_both

->  gen ps_both2=ps2*pen_both

->  gen ps_both3=ps3*pen_both

->  gen ps_both4=ps4*pen_both

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_one pen_both ps2 ps3 ps4 ps_one* ps_both*  i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y
> 2 y3 y4 y5 y6  if fips_power~=., absorb(provider_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_lnprice, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 

----------------------------
                      (1)   
                  lnprice   
----------------------------
pen_one             0.024   
                  (0.015)   

pen_both            0.072***
                  (0.020)   

ps2                 0.055***
                  (0.013)   

ps3                 0.105***
                  (0.015)   

ps4                 0.154***
                  (0.018)   

ps_one2            -0.021   
                  (0.017)   

ps_one3            -0.042***
                  (0.016)   

ps_one4            -0.064***
                  (0.019)   

ps_both2           -0.065***
                  (0.018)   

ps_both3           -0.103***
                  (0.021)   

ps_both4           -0.108***
                  (0.023)   

1.fips_power       -0.040** 
                  (0.020)   

2.fips_power       -0.112***
                  (0.034)   

2.fips_size        -0.057** 
                  (0.025)   

TotalPop            0.000   
                  (0.000)   

Age_18to34          1.931   
                  (1.797)   

Age_35to64          1.591   
                  (2.082)   

Age_65plus          0.014   
                  (1.996)   

Race_White          0.206   
                  (0.349)   

Race_Black         -0.775   
                  (1.317)   

Income_50~75       -0.956   
                  (0.690)   

Income_7~100        0.587   
                  (0.806)   

Income_1~150       -0.156   
                  (0.709)   

Income_150~s        1.309*  
                  (0.741)   

Educ_HSGrad         0.114   
                  (0.709)   

Educ_Bach          -1.234   
                  (1.026)   

teach1             -0.092*  
                  (0.051)   

teach2             -0.016   
                  (0.011)   

System              0.003   
                  (0.023)   

Nonprofit           0.022   
                  (0.071)   

Profit              0.078   
                  (0.073)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other         0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.009   
                  (0.013)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.010   
                  (0.091)   

m_lother            0.088   
                  (0.091)   

m_p_d               0.000   
                      (.)   

m_op                0.000   
                      (.)   

y2                 -0.029***
                  (0.009)   

y3                 -0.036***
                  (0.014)   

y4                 -0.049** 
                  (0.024)   

y5                 -0.004   
                  (0.030)   

y6                  0.000   
                      (.)   
----------------------------
N                    7205   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. 
. ********************************************************************************
. *** Table 6: Robustness                                                                                 
. ********************************************************************************
. ******** County specific linear time trends
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6, absorb(provider_number fips fi
> ps#year_trend) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6, absorb(provid
> er_number fips fips#year_trend) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both            0.002          -0.007          -0.004           0.004          -0.005           0.025           0.002   
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.025)         (0.014)   

pen_one             0.007*         -0.006**         0.001          -0.001          -0.005          -0.003          -0.004   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.003)         (0.015)         (0.009)   

1.fips_power       -0.001          -0.015***       -0.017**         0.017**        -0.002          -0.083***        0.017   
                  (0.005)         (0.004)         (0.007)         (0.007)         (0.005)         (0.021)         (0.014)   

2.fips_power       -0.018*         -0.042***       -0.060***        0.060***       -0.000          -0.192***        0.021   
                  (0.010)         (0.009)         (0.013)         (0.013)         (0.007)         (0.042)         (0.019)   

2.fips_size         0.000           0.000           0.000           0.000           0.000        -239.471           0.000   
                      (.)             (.)             (.)             (.)             (.)       (7.3e+07)             (.)   

TotalPop           -0.033          -0.009          -0.042           0.042           0.196          -0.435          -0.148   
               (8423.557)      (6355.506)       (1.2e+04)       (1.2e+04)      (6680.000)       (3.5e+04)       (2.9e+04)   

Age_18to34          0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Age_35to64          0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Age_65plus          0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Race_White          0.000           0.000           0.000           0.000           0.000        -8.2e+03           0.000   
                      (.)             (.)             (.)             (.)             (.)       (1.8e+08)             (.)   

Race_Black       -326.126        -311.961        -638.166         638.166        1931.179        -1.0e+04        -943.931   
                (8.4e+07)       (5.2e+07)       (1.2e+08)       (1.2e+08)       (4.2e+07)       (2.9e+08)       (1.9e+08)   

Income_50~75        0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Income_7~100        0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Income_1~150        0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Income_150~s        0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Educ_HSGrad         0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

Educ_Bach           0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

teach1             -0.015           0.002          -0.013           0.013          -0.008          -0.089**        -0.021   
                  (0.016)         (0.004)         (0.016)         (0.016)         (0.007)         (0.045)         (0.028)   

teach2              0.007*         -0.001           0.006          -0.006          -0.001          -0.009           0.011   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.003)         (0.015)         (0.012)   

System             -0.005          -0.002          -0.007           0.007           0.007*          0.006           0.029   
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.004)         (0.033)         (0.020)   

Nonprofit           0.004          -0.009          -0.004           0.004          -0.003           0.057           0.016   
                  (0.013)         (0.007)         (0.011)         (0.011)         (0.007)         (0.084)         (0.068)   

Profit             -0.003          -0.014*         -0.017           0.017          -0.001           0.125           0.055   
                  (0.014)         (0.008)         (0.013)         (0.013)         (0.008)         (0.083)         (0.077)   

Labor_Nurse         0.000*          0.000**         0.000***       -0.000***        0.000           0.000**        -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds                0.000           0.000           0.000          -0.000           0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.003          -0.002          -0.006           0.006          -0.005*          0.024          -0.007   
                  (0.004)         (0.003)         (0.005)         (0.005)         (0.003)         (0.019)         (0.011)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse           -0.000          -0.039***       -0.039           0.039           0.039          -0.092          -0.149** 
                  (0.027)         (0.013)         (0.029)         (0.029)         (0.028)         (0.078)         (0.061)   

m_lother            0.013           0.001           0.014          -0.014          -0.025           0.201**         0.063   
                  (0.027)         (0.010)         (0.029)         (0.029)         (0.016)         (0.080)         (0.053)   

m_p_d               0.003          -0.003           0.000          -0.000          -0.016*          0.000          -0.008   
                  (0.008)         (0.007)         (0.012)         (0.012)         (0.008)             (.)         (0.046)   

m_op                0.002           0.000           0.002          -0.002          -0.004           0.000           0.012   
                  (0.006)         (0.003)         (0.006)         (0.006)         (0.004)             (.)         (0.013)   

y2                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

y3                  0.000           0.000           0.000           0.000           0.000        -757.764           0.000   
                      (.)             (.)             (.)             (.)             (.)       (7.9e+07)             (.)   

y4                  0.000           0.000           0.000           0.000           0.000         1.7e+04           0.000   
                      (.)             (.)             (.)             (.)             (.)       (5.0e+08)             (.)   

y5                  0.000           0.000           0.000           0.000           0.000         607.206           0.000   
                      (.)             (.)             (.)             (.)             (.)       (4.4e+08)             (.)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    6808            6808            6808            6808            6498            5608            6808   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. ******** Only years < 2014 to see if full ACA is confounding results
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6 if Year<2014, absorb(provider_n
> umber fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6  if Year<2014, 
> absorb(provider_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.011*         -0.014***       -0.025***        0.025***        0.001           0.009           0.023*  
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.023)         (0.012)   

pen_one            -0.004          -0.008***       -0.011**         0.011**        -0.004           0.000           0.006   
                  (0.004)         (0.003)         (0.004)         (0.004)         (0.003)         (0.015)         (0.008)   

1.fips_power        0.009          -0.013**        -0.003           0.003          -0.008          -0.020           0.020   
                  (0.007)         (0.006)         (0.009)         (0.009)         (0.006)         (0.026)         (0.015)   

2.fips_power       -0.002          -0.032***       -0.034**         0.034**        -0.009          -0.099**         0.021   
                  (0.011)         (0.011)         (0.015)         (0.015)         (0.008)         (0.044)         (0.020)   

2.fips_size        -0.002          -0.015***       -0.018*          0.018*          0.006          -0.064**        -0.070*  
                  (0.006)         (0.005)         (0.009)         (0.009)         (0.004)         (0.028)         (0.038)   

TotalPop            0.000           0.000           0.000          -0.000          -0.000           0.000*          0.000** 
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34         -0.026           0.176           0.150          -0.150           0.118           3.744          -1.923   
                  (0.594)         (0.376)         (0.711)         (0.711)         (0.414)         (2.318)         (1.470)   

Age_35to64         -0.972          -0.389          -1.361*          1.361*         -0.362           3.126           0.488   
                  (0.642)         (0.460)         (0.756)         (0.756)         (0.537)         (2.798)         (1.605)   

Age_65plus         -1.180*          0.117          -1.063           1.063          -0.431          -0.793          -0.807   
                  (0.668)         (0.511)         (0.823)         (0.823)         (0.480)         (2.696)         (1.411)   

Race_White         -0.245**        -0.099*         -0.344***        0.344***        0.038          -0.370          -0.435*  
                  (0.121)         (0.052)         (0.126)         (0.126)         (0.069)         (0.430)         (0.241)   

Race_Black          1.134***       -0.377*          0.757*         -0.757*          0.210          -2.214          -1.020   
                  (0.331)         (0.223)         (0.393)         (0.393)         (0.225)         (1.678)         (0.951)   

Income_50~75       -0.190          -0.188          -0.378*          0.378*         -0.188          -1.102          -0.115   
                  (0.195)         (0.120)         (0.228)         (0.228)         (0.155)         (0.850)         (0.404)   

Income_7~100        0.041          -0.112          -0.071           0.071          -0.453***       -0.009          -0.620   
                  (0.228)         (0.152)         (0.269)         (0.269)         (0.148)         (0.917)         (0.543)   

Income_1~150        0.063          -0.084          -0.021           0.021          -0.103          -0.695          -0.923*  
                  (0.207)         (0.127)         (0.236)         (0.236)         (0.152)         (0.861)         (0.552)   

Income_150~s       -0.515**         0.377***       -0.138           0.138           0.023           1.187           1.429***
                  (0.215)         (0.128)         (0.243)         (0.243)         (0.166)         (0.872)         (0.463)   

Educ_HSGrad        -0.276          -0.077          -0.353           0.353           0.128          -0.172           0.366   
                  (0.203)         (0.133)         (0.234)         (0.234)         (0.136)         (0.829)         (0.440)   

Educ_Bach           0.386          -0.243           0.143          -0.143           0.219           0.058          -0.433   
                  (0.271)         (0.173)         (0.305)         (0.305)         (0.195)         (1.296)         (0.596)   

teach1              0.001           0.001           0.002          -0.002          -0.007          -0.103*         -0.019   
                  (0.020)         (0.003)         (0.020)         (0.020)         (0.009)         (0.059)         (0.022)   

teach2              0.010*          0.000           0.010          -0.010          -0.005          -0.016           0.018   
                  (0.006)         (0.003)         (0.007)         (0.007)         (0.004)         (0.025)         (0.016)   

System              0.005          -0.001           0.004          -0.004           0.003           0.014           0.026   
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.004)         (0.027)         (0.026)   

Nonprofit           0.005          -0.012          -0.007           0.007          -0.003           0.030           0.065   
                  (0.011)         (0.007)         (0.011)         (0.011)         (0.007)         (0.075)         (0.072)   

Profit              0.008          -0.018**        -0.011           0.011          -0.011           0.054           0.083   
                  (0.011)         (0.008)         (0.012)         (0.012)         (0.007)         (0.078)         (0.087)   

Labor_Nurse         0.000           0.000**         0.000*         -0.000*          0.000           0.000*         -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other        -0.000          -0.000          -0.000           0.000          -0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds                0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.001          -0.009**        -0.009*          0.009*          0.001           0.011           0.007   
                  (0.004)         (0.003)         (0.005)         (0.005)         (0.003)         (0.018)         (0.008)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lother            0.049***        0.017***        0.066***       -0.066***       -0.041***        0.214***        0.084***
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.045)         (0.016)   

m_p_d               0.008          -0.004           0.004          -0.004          -0.016**         0.000          -0.017   
                  (0.007)         (0.010)         (0.015)         (0.015)         (0.007)             (.)         (0.077)   

m_op                0.008           0.002           0.010          -0.010          -0.005           0.000           0.006   
                  (0.007)         (0.003)         (0.007)         (0.007)         (0.005)             (.)         (0.011)   

y2                 -0.004          -0.003**        -0.007**         0.007**         0.001          -0.032***        0.050***
                  (0.002)         (0.001)         (0.003)         (0.003)         (0.002)         (0.010)         (0.006)   

y3                 -0.009*         -0.010***       -0.018***        0.018***        0.003          -0.047***        0.095***
                  (0.004)         (0.003)         (0.005)         (0.005)         (0.003)         (0.017)         (0.010)   

y4                 -0.005          -0.003          -0.007           0.007           0.005          -0.072**         0.104***
                  (0.008)         (0.006)         (0.010)         (0.010)         (0.005)         (0.031)         (0.016)   

y5                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    6640            6640            6640            6640            6408            5829            6640   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. 
. 
. ******** Controlling for expansion
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  expand i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6, absorb(provider_number 
> fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  expand  i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6, absorb(
> provider_number fips) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.004          -0.017***       -0.021***        0.021***        0.002          -0.004           0.022** 
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.018)         (0.010)   

pen_one            -0.001          -0.010***       -0.010***        0.010***       -0.001          -0.013           0.008   
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.012)         (0.007)   

expand              0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

1.fips_power        0.004          -0.009          -0.005           0.005          -0.005          -0.041*          0.013   
                  (0.005)         (0.006)         (0.008)         (0.008)         (0.006)         (0.021)         (0.012)   

2.fips_power       -0.008          -0.023**        -0.031**         0.031**        -0.005          -0.120***        0.010   
                  (0.009)         (0.010)         (0.013)         (0.013)         (0.007)         (0.035)         (0.016)   

2.fips_size        -0.005          -0.016***       -0.021**         0.021**         0.008**        -0.064**        -0.074** 
                  (0.006)         (0.005)         (0.009)         (0.009)         (0.004)         (0.026)         (0.036)   

TotalPop            0.000           0.000           0.000*         -0.000*         -0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.694          -0.112           0.581          -0.581           0.065           2.746          -2.691** 
                  (0.469)         (0.304)         (0.562)         (0.562)         (0.347)         (1.857)         (1.294)   

Age_35to64          0.011          -0.749**        -0.738           0.738          -0.324           2.263          -0.494   
                  (0.512)         (0.348)         (0.598)         (0.598)         (0.475)         (2.144)         (1.395)   

Age_65plus         -0.333           0.198          -0.135           0.135          -0.319           0.032          -1.823   
                  (0.509)         (0.334)         (0.589)         (0.589)         (0.416)         (2.061)         (1.189)   

Race_White         -0.227**        -0.088*         -0.315***        0.315***        0.044           0.048          -0.385*  
                  (0.103)         (0.051)         (0.112)         (0.112)         (0.062)         (0.363)         (0.221)   

Race_Black          0.866***       -0.161           0.706**        -0.706**         0.149          -0.467          -1.057   
                  (0.273)         (0.174)         (0.318)         (0.318)         (0.189)         (1.353)         (0.766)   

Income_50~75       -0.093          -0.131          -0.225           0.225          -0.256*         -0.839          -0.319   
                  (0.174)         (0.108)         (0.205)         (0.205)         (0.149)         (0.701)         (0.398)   

Income_7~100        0.079          -0.112          -0.033           0.033          -0.395***        0.742          -0.788   
                  (0.211)         (0.130)         (0.238)         (0.238)         (0.138)         (0.810)         (0.510)   

Income_1~150       -0.202           0.044          -0.159           0.159          -0.070          -0.115          -1.037** 
                  (0.183)         (0.137)         (0.222)         (0.222)         (0.136)         (0.719)         (0.480)   

Income_150~s       -0.158           0.403***        0.246          -0.246           0.007           1.605**         1.357***
                  (0.182)         (0.121)         (0.208)         (0.208)         (0.148)         (0.756)         (0.452)   

Educ_HSGrad        -0.189          -0.120          -0.309           0.309           0.166          -0.073           0.470   
                  (0.184)         (0.112)         (0.208)         (0.208)         (0.123)         (0.719)         (0.366)   

Educ_Bach           0.080          -0.419**        -0.340           0.340           0.206          -1.346           0.170   
                  (0.240)         (0.185)         (0.284)         (0.284)         (0.165)         (1.053)         (0.532)   

teach1             -0.001           0.004           0.003          -0.003          -0.003          -0.086*         -0.018   
                  (0.014)         (0.004)         (0.014)         (0.014)         (0.006)         (0.052)         (0.016)   

teach2              0.004          -0.001           0.004          -0.004          -0.002          -0.015           0.014*  
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

System              0.000          -0.004          -0.004           0.004           0.006*          0.005           0.031   
                  (0.004)         (0.004)         (0.006)         (0.006)         (0.004)         (0.023)         (0.021)   

Nonprofit           0.011          -0.011          -0.001           0.001          -0.001           0.024           0.036   
                  (0.011)         (0.009)         (0.011)         (0.011)         (0.005)         (0.071)         (0.059)   

Profit              0.001          -0.015*         -0.013           0.013          -0.007           0.072           0.081   
                  (0.012)         (0.009)         (0.013)         (0.013)         (0.006)         (0.072)         (0.073)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000*         -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.002          -0.010***       -0.012***        0.012***       -0.000           0.005           0.004   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.002)         (0.013)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000          -0.020          -0.020           0.020          -0.025          -0.001          -0.190*  
                  (0.015)         (0.014)         (0.026)         (0.026)         (0.048)         (0.098)         (0.106)   

m_lother            0.027*         -0.009           0.018          -0.018           0.034           0.087           0.038   
                  (0.014)         (0.011)         (0.025)         (0.025)         (0.048)         (0.098)         (0.055)   

m_p_d               0.004          -0.001           0.002          -0.002          -0.020**         0.000           0.022   
                  (0.005)         (0.009)         (0.012)         (0.012)         (0.009)             (.)         (0.044)   

m_op                0.002          -0.001           0.001          -0.001          -0.004           0.000           0.016   
                  (0.005)         (0.002)         (0.006)         (0.006)         (0.004)             (.)         (0.012)   

y2                 -0.006***       -0.004***       -0.010***        0.010***        0.001          -0.035***        0.054***
                  (0.002)         (0.001)         (0.003)         (0.003)         (0.002)         (0.009)         (0.005)   

y3                 -0.012***       -0.010***       -0.022***        0.022***        0.002          -0.050***        0.102***
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.003)         (0.014)         (0.008)   

y4                 -0.013*         -0.001          -0.014*          0.014*          0.003          -0.060**         0.114***
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.004)         (0.024)         (0.014)   

y5                 -0.018**        -0.006          -0.024**         0.024**         0.003          -0.020           0.160***
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.005)         (0.030)         (0.017)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    8297            8297            8297            8297            8007            7205            8297   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. ******** Controlling for hcahps ratings
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one hcahps_rating  i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6 , absorb(provider
> _number fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one hcahps_rating  i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6, 
> absorb(provider_number fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 ***
>  0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.004          -0.016***       -0.021***        0.021***        0.002          -0.004           0.022** 
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.018)         (0.010)   

pen_one            -0.001          -0.010***       -0.010***        0.010***       -0.001          -0.013           0.008   
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.012)         (0.007)   

hcahps_rat~g        0.000          -0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.001)         (0.001)   

1.fips_power        0.004          -0.009          -0.005           0.005          -0.005          -0.040*          0.013   
                  (0.005)         (0.006)         (0.008)         (0.008)         (0.006)         (0.021)         (0.012)   

2.fips_power       -0.008          -0.023**        -0.031**         0.031**        -0.005          -0.120***        0.010   
                  (0.009)         (0.010)         (0.013)         (0.013)         (0.007)         (0.035)         (0.016)   

2.fips_size        -0.005          -0.016***       -0.021**         0.021**         0.008**        -0.064**        -0.074** 
                  (0.006)         (0.005)         (0.009)         (0.009)         (0.004)         (0.026)         (0.036)   

TotalPop            0.000           0.000           0.000*         -0.000*         -0.000           0.000**         0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.694          -0.112           0.581          -0.581           0.066           2.743          -2.691** 
                  (0.469)         (0.304)         (0.562)         (0.562)         (0.347)         (1.856)         (1.293)   

Age_35to64          0.004          -0.746**        -0.742           0.742          -0.328           2.247          -0.517   
                  (0.513)         (0.348)         (0.599)         (0.599)         (0.475)         (2.143)         (1.397)   

Age_65plus         -0.330           0.197          -0.133           0.133          -0.316           0.040          -1.812   
                  (0.509)         (0.334)         (0.588)         (0.588)         (0.415)         (2.061)         (1.188)   

Race_White         -0.228**        -0.088*         -0.316***        0.316***        0.042           0.045          -0.389*  
                  (0.103)         (0.052)         (0.112)         (0.112)         (0.062)         (0.363)         (0.221)   

Race_Black          0.867***       -0.161           0.706**        -0.706**         0.149          -0.464          -1.053   
                  (0.274)         (0.174)         (0.319)         (0.319)         (0.190)         (1.352)         (0.766)   

Income_50~75       -0.091          -0.132          -0.223           0.223          -0.255*         -0.833          -0.311   
                  (0.175)         (0.108)         (0.205)         (0.205)         (0.149)         (0.701)         (0.399)   

Income_7~100        0.079          -0.112          -0.033           0.033          -0.396***        0.742          -0.790   
                  (0.211)         (0.130)         (0.238)         (0.238)         (0.138)         (0.810)         (0.510)   

Income_1~150       -0.201           0.043          -0.158           0.158          -0.069          -0.112          -1.033** 
                  (0.183)         (0.137)         (0.222)         (0.222)         (0.136)         (0.719)         (0.479)   

Income_150~s       -0.160           0.404***        0.244          -0.244           0.005           1.599**         1.348***
                  (0.182)         (0.121)         (0.208)         (0.208)         (0.148)         (0.756)         (0.453)   

Educ_HSGrad        -0.186          -0.121          -0.307           0.307           0.168          -0.067           0.479   
                  (0.184)         (0.112)         (0.208)         (0.208)         (0.122)         (0.719)         (0.366)   

Educ_Bach           0.079          -0.419**        -0.340           0.340           0.206          -1.346           0.168   
                  (0.240)         (0.186)         (0.284)         (0.284)         (0.165)         (1.053)         (0.532)   

teach1             -0.001           0.004           0.003          -0.003          -0.003          -0.086*         -0.018   
                  (0.014)         (0.004)         (0.014)         (0.014)         (0.006)         (0.052)         (0.016)   

teach2              0.004          -0.001           0.004          -0.004          -0.002          -0.015           0.014*  
                  (0.003)         (0.002)         (0.004)         (0.004)         (0.002)         (0.011)         (0.007)   

System              0.000          -0.004          -0.004           0.004           0.006*          0.005           0.030   
                  (0.004)         (0.004)         (0.006)         (0.006)         (0.004)         (0.023)         (0.021)   

Nonprofit           0.011          -0.012          -0.001           0.001          -0.001           0.024           0.036   
                  (0.011)         (0.009)         (0.011)         (0.011)         (0.005)         (0.071)         (0.059)   

Profit              0.002          -0.015*         -0.013           0.013          -0.007           0.073           0.082   
                  (0.012)         (0.009)         (0.013)         (0.013)         (0.006)         (0.072)         (0.073)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000*         -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds                0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.002          -0.010***       -0.012***        0.012***       -0.000           0.005           0.004   
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.002)         (0.013)         (0.007)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000          -0.020          -0.020           0.020          -0.025          -0.000          -0.189*  
                  (0.015)         (0.014)         (0.026)         (0.026)         (0.048)         (0.098)         (0.106)   

m_lother            0.027*         -0.009           0.018          -0.018           0.034           0.087           0.038   
                  (0.014)         (0.011)         (0.025)         (0.025)         (0.048)         (0.098)         (0.055)   

m_p_d               0.004          -0.001           0.002          -0.002          -0.020**         0.000           0.021   
                  (0.005)         (0.009)         (0.012)         (0.012)         (0.009)             (.)         (0.043)   

m_op                0.002          -0.001           0.001          -0.001          -0.004           0.000           0.016   
                  (0.005)         (0.002)         (0.006)         (0.006)         (0.004)             (.)         (0.012)   

y2                 -0.006***       -0.004***       -0.010***        0.010***        0.001          -0.035***        0.053***
                  (0.002)         (0.001)         (0.003)         (0.003)         (0.002)         (0.009)         (0.005)   

y3                 -0.012***       -0.010***       -0.022***        0.022***        0.002          -0.051***        0.101***
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.003)         (0.014)         (0.009)   

y4                 -0.013**        -0.001          -0.014*          0.014*          0.003          -0.061**         0.113***
                  (0.007)         (0.004)         (0.008)         (0.008)         (0.004)         (0.025)         (0.014)   

y5                 -0.019**        -0.006          -0.024***        0.024***        0.002          -0.021           0.159***
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.005)         (0.030)         (0.017)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    8297            8297            8297            8297            8007            7205            8297   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. ******** By Medicaid Expansion
. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6 if expand==0 , absorb(provider_
> number fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6 if expand==0 ,
>  absorb(provider_number fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, title("Nonexpansion States") b(%5.3f) se(
> %5.3f) star(* 0.1 ** 0.05 *** 0.01) 

Nonexpansion States
----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both            0.009          -0.010*         -0.002           0.002          -0.003          -0.041           0.004   
                  (0.007)         (0.006)         (0.009)         (0.009)         (0.005)         (0.026)         (0.014)   

pen_one             0.005          -0.007**        -0.002           0.002          -0.005*         -0.029*          0.003   
                  (0.004)         (0.003)         (0.005)         (0.005)         (0.003)         (0.017)         (0.009)   

1.fips_power       -0.006          -0.011          -0.017           0.017          -0.015          -0.067*          0.000   
                  (0.009)         (0.009)         (0.013)         (0.013)         (0.013)         (0.037)         (0.020)   

2.fips_power       -0.027**        -0.031**        -0.058***        0.058***       -0.016          -0.156***        0.002   
                  (0.013)         (0.015)         (0.020)         (0.020)         (0.014)         (0.055)         (0.024)   

2.fips_size         0.002          -0.022***       -0.021           0.021           0.005          -0.040          -0.011   
                  (0.011)         (0.008)         (0.017)         (0.017)         (0.006)         (0.037)         (0.018)   

TotalPop            0.000***        0.000           0.000***       -0.000***       -0.000          -0.000           0.000***
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          1.209*         -0.594           0.615          -0.615          -0.153           3.709           0.767   
                  (0.684)         (0.465)         (0.836)         (0.836)         (0.508)         (3.104)         (1.750)   

Age_35to64          0.671          -1.193**        -0.522           0.522          -0.950           3.335           3.782** 
                  (0.764)         (0.511)         (0.877)         (0.877)         (0.711)         (3.582)         (1.778)   

Age_65plus          0.195          -0.646          -0.451           0.451          -0.432           2.272           3.445** 
                  (0.684)         (0.545)         (0.850)         (0.850)         (0.649)         (3.324)         (1.439)   

Race_White         -0.280*         -0.184**        -0.464***        0.464***        0.063           0.575          -0.176   
                  (0.149)         (0.073)         (0.162)         (0.162)         (0.082)         (0.509)         (0.248)   

Race_Black          0.357          -0.432*         -0.075           0.075           0.195           0.592          -0.618   
                  (0.335)         (0.244)         (0.410)         (0.410)         (0.259)         (1.932)         (0.956)   

Income_50~75       -0.231          -0.120          -0.351           0.351          -0.306          -0.472          -0.053   
                  (0.213)         (0.145)         (0.264)         (0.264)         (0.194)         (0.961)         (0.507)   

Income_7~100       -0.210          -0.098          -0.308           0.308          -0.397**         1.283          -1.247*  
                  (0.248)         (0.187)         (0.303)         (0.303)         (0.191)         (1.188)         (0.642)   

Income_1~150       -0.174           0.196           0.021          -0.021          -0.019           0.228          -0.944   
                  (0.241)         (0.241)         (0.317)         (0.317)         (0.184)         (1.099)         (0.627)   

Income_150~s       -0.511**         0.564**         0.053          -0.053          -0.178           1.563          -0.221   
                  (0.251)         (0.223)         (0.314)         (0.314)         (0.211)         (1.245)         (0.617)   

Educ_HSGrad        -0.203          -0.244          -0.447           0.447           0.051          -0.362           0.630   
                  (0.246)         (0.156)         (0.281)         (0.281)         (0.158)         (1.004)         (0.434)   

Educ_Bach           0.140          -0.348          -0.209           0.209           0.094          -1.699          -0.408   
                  (0.297)         (0.265)         (0.361)         (0.361)         (0.226)         (1.413)         (0.644)   

teach1             -0.020           0.004          -0.016           0.016           0.015**        -0.009          -0.003   
                  (0.031)         (0.003)         (0.031)         (0.031)         (0.007)         (0.053)         (0.030)   

teach2              0.006          -0.003           0.004          -0.004          -0.003           0.006           0.026***
                  (0.004)         (0.003)         (0.005)         (0.005)         (0.003)         (0.017)         (0.010)   

System             -0.000           0.002           0.002          -0.002           0.003           0.037          -0.020   
                  (0.007)         (0.005)         (0.008)         (0.008)         (0.004)         (0.035)         (0.016)   

Nonprofit           0.003          -0.017          -0.014           0.014           0.002           0.001           0.036   
                  (0.010)         (0.016)         (0.016)         (0.016)         (0.011)         (0.122)         (0.057)   

Profit              0.003          -0.023          -0.021           0.021          -0.006           0.074           0.053   
                  (0.010)         (0.015)         (0.016)         (0.016)         (0.010)         (0.119)         (0.052)   

Labor_Nurse         0.000           0.000           0.000          -0.000           0.000           0.000**        -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000          -0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds               -0.000           0.000           0.000          -0.000           0.000           0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate          0.008          -0.005           0.003          -0.003          -0.004          -0.007          -0.005   
                  (0.005)         (0.004)         (0.007)         (0.007)         (0.003)         (0.018)         (0.010)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.025**        -0.008           0.017          -0.017          -0.071           0.109          -0.172*  
                  (0.011)         (0.011)         (0.017)         (0.017)         (0.054)         (0.122)         (0.100)   

m_lother            0.014          -0.024***       -0.010           0.010           0.076           0.009           0.051   
                  (0.009)         (0.004)         (0.010)         (0.010)         (0.054)         (0.119)         (0.058)   

m_p_d              -0.013**        -0.011**        -0.024***        0.024***       -0.009**         0.000          -0.109   
                  (0.006)         (0.005)         (0.008)         (0.008)         (0.004)             (.)         (0.112)   

m_op                0.002           0.002           0.004          -0.004          -0.007           0.000          -0.013   
                  (0.006)         (0.003)         (0.006)         (0.006)         (0.006)             (.)         (0.012)   

y2                 -0.002          -0.005***       -0.007**         0.007**         0.001          -0.041***        0.053***
                  (0.003)         (0.002)         (0.003)         (0.003)         (0.002)         (0.013)         (0.006)   

y3                 -0.009*         -0.012***       -0.020***        0.020***        0.002          -0.064***        0.097***
                  (0.005)         (0.003)         (0.006)         (0.006)         (0.003)         (0.020)         (0.010)   

y4                 -0.024***       -0.008          -0.032***        0.032***        0.009          -0.058*          0.115***
                  (0.009)         (0.006)         (0.011)         (0.011)         (0.006)         (0.035)         (0.018)   

y5                 -0.041***       -0.009          -0.051***        0.051***        0.008          -0.012           0.152***
                  (0.010)         (0.008)         (0.012)         (0.012)         (0.007)         (0.043)         (0.021)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    3954            3954            3954            3954            3804            3456            3954   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. foreach y of global SHARE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one  i.fips_power i.fips_size ${COUNTY_VARS} ${HOSPITAL_VARS} m_*  y2 y3 y4 y5 y6 if expand==1 , absorb(provider_
> number fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. foreach y of global PRICE_OUTCOMES{
  2. qui: reghdfe `y' pen_both pen_one   i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 y6 if expand==1 ,
>  absorb(provider_number fips ) cluster(provider_number)
  3. est store h_`y'
  4. }

. esttab h_medicaid_share h_medicare_share h_public_share h_other_share h_pindex h_lnprice h_lnprice_hcci, title("Expansion States") b(%5.3f) se(%5.
> 3f) star(* 0.1 ** 0.05 *** 0.01) 

Expansion States
----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             medicaid_s~e    medicare_s~e    public_share     other_share          pindex         lnprice    lnprice_hcci   
----------------------------------------------------------------------------------------------------------------------------
pen_both           -0.011*         -0.019***       -0.030***        0.030***        0.004           0.023           0.030** 
                  (0.006)         (0.004)         (0.007)         (0.007)         (0.004)         (0.023)         (0.013)   

pen_one            -0.003          -0.010***       -0.014***        0.014***        0.003           0.006           0.012   
                  (0.005)         (0.003)         (0.005)         (0.005)         (0.003)         (0.017)         (0.010)   

1.fips_power        0.010*         -0.008           0.002          -0.002           0.000          -0.028           0.012   
                  (0.006)         (0.009)         (0.011)         (0.011)         (0.005)         (0.023)         (0.015)   

2.fips_power        0.013          -0.014          -0.001           0.001           0.002          -0.094**         0.003   
                  (0.011)         (0.012)         (0.015)         (0.015)         (0.006)         (0.040)         (0.026)   

2.fips_size        -0.008          -0.009*         -0.017**         0.017**         0.012**        -0.084**        -0.126** 
                  (0.006)         (0.006)         (0.008)         (0.008)         (0.005)         (0.037)         (0.060)   

TotalPop           -0.000*          0.000          -0.000           0.000          -0.000           0.001***       -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Age_18to34          0.308          -0.268           0.040          -0.040           0.097           1.482          -2.746   
                  (0.703)         (0.410)         (0.821)         (0.821)         (0.527)         (2.533)         (1.869)   

Age_35to64         -0.258          -0.952**        -1.209           1.209           0.391           0.197          -1.949   
                  (0.772)         (0.478)         (0.904)         (0.904)         (0.655)         (2.766)         (2.318)   

Age_65plus         -0.947           0.454          -0.493           0.493          -0.186          -2.921          -4.753***
                  (0.805)         (0.429)         (0.888)         (0.888)         (0.533)         (2.621)         (1.616)   

Race_White         -0.156           0.051          -0.106           0.106           0.073          -0.344          -0.865** 
                  (0.146)         (0.080)         (0.162)         (0.162)         (0.087)         (0.562)         (0.399)   

Race_Black          1.541***        0.313           1.854***       -1.854***        0.336          -0.347          -2.014*  
                  (0.465)         (0.286)         (0.524)         (0.524)         (0.283)         (1.899)         (1.174)   

Income_50~75       -0.150          -0.130          -0.280           0.280          -0.032          -0.883          -1.074*  
                  (0.298)         (0.162)         (0.326)         (0.326)         (0.227)         (0.990)         (0.651)   

Income_7~100        0.256          -0.124           0.132          -0.132          -0.261           0.277          -0.296   
                  (0.347)         (0.180)         (0.375)         (0.375)         (0.195)         (1.081)         (0.858)   

Income_1~150       -0.209          -0.078          -0.287           0.287          -0.005          -0.290          -1.340*  
                  (0.257)         (0.163)         (0.307)         (0.307)         (0.199)         (0.954)         (0.740)   

Income_150~s       -0.339           0.269*         -0.070           0.070           0.314           1.312           1.359** 
                  (0.275)         (0.160)         (0.306)         (0.306)         (0.210)         (0.946)         (0.687)   

Educ_HSGrad        -0.208           0.167          -0.041           0.041           0.399**         0.368          -0.070   
                  (0.275)         (0.146)         (0.311)         (0.311)         (0.203)         (0.989)         (0.638)   

Educ_Bach           0.180          -0.471*         -0.291           0.291           0.222          -1.305           1.231   
                  (0.404)         (0.252)         (0.455)         (0.455)         (0.244)         (1.578)         (0.873)   

teach1              0.012           0.003           0.015*         -0.015*         -0.014*         -0.120*         -0.026   
                  (0.008)         (0.006)         (0.009)         (0.009)         (0.008)         (0.071)         (0.017)   

teach2              0.002           0.001           0.003          -0.003          -0.000          -0.037***       -0.000   
                  (0.005)         (0.002)         (0.006)         (0.006)         (0.003)         (0.014)         (0.011)   

System             -0.000          -0.007          -0.008           0.008           0.007          -0.013           0.059*  
                  (0.006)         (0.006)         (0.008)         (0.008)         (0.005)         (0.030)         (0.031)   

Nonprofit           0.019          -0.004           0.015          -0.015          -0.001           0.048           0.031   
                  (0.016)         (0.006)         (0.013)         (0.013)         (0.005)         (0.081)         (0.094)   

Profit             -0.001          -0.003          -0.004           0.004          -0.007           0.065           0.100   
                  (0.020)         (0.008)         (0.017)         (0.017)         (0.006)         (0.088)         (0.127)   

Labor_Nurse         0.000           0.000           0.000          -0.000          -0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Labor_Other         0.000           0.000           0.000          -0.000           0.000           0.000          -0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

Beds                0.000          -0.000          -0.000           0.000           0.000**         0.000           0.000   
                  (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)         (0.000)   

vbp_rebate         -0.008*         -0.012***       -0.020***        0.020***        0.002           0.015           0.005   
                  (0.005)         (0.003)         (0.005)         (0.005)         (0.003)         (0.018)         (0.011)   

m_census            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_sys               0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_teach             0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_hcahps            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lnurse            0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   

m_lother            0.049***        0.014***        0.063***       -0.063***       -0.041***        0.221***        0.064***
                  (0.008)         (0.005)         (0.009)         (0.009)         (0.005)         (0.055)         (0.022)   

m_p_d               0.009           0.004           0.013          -0.013          -0.026**         0.000           0.055** 
                  (0.006)         (0.012)         (0.016)         (0.016)         (0.011)             (.)         (0.026)   

m_op                0.003          -0.003          -0.000           0.000           0.001           0.000           0.042** 
                  (0.008)         (0.004)         (0.009)         (0.009)         (0.004)             (.)         (0.020)   

y2                 -0.007*         -0.000          -0.007*          0.007*          0.001          -0.025**         0.054***
                  (0.004)         (0.002)         (0.004)         (0.004)         (0.003)         (0.012)         (0.008)   

y3                 -0.010          -0.005          -0.015**         0.015**         0.003          -0.028           0.103***
                  (0.006)         (0.003)         (0.007)         (0.007)         (0.004)         (0.020)         (0.014)   

y4                 -0.001           0.008           0.007          -0.007          -0.000          -0.050           0.112***
                  (0.010)         (0.006)         (0.011)         (0.011)         (0.007)         (0.034)         (0.023)   

y5                  0.008           0.001           0.009          -0.009          -0.000          -0.009           0.164***
                  (0.013)         (0.007)         (0.014)         (0.014)         (0.008)         (0.041)         (0.028)   

y6                  0.000           0.000           0.000           0.000           0.000           0.000           0.000   
                      (.)             (.)             (.)             (.)             (.)             (.)             (.)   
----------------------------------------------------------------------------------------------------------------------------
N                    4343            4343            4343            4343            4203            3749            4343   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. est clear

. ********************************************************************************
. *** Table 7: Condition Specific Analysis                                                                                
. ********************************************************************************
. *** Loop through conditions.  "CONDITION`d'PRICE" is the place holder.
. /*
> MDC reference:
> 0 - all admissions
> 1 - Nervous system
> 4 - Respiratory system
> 5 - Circulatory system
> 8 - Musculoskeletal system and connective tissue
> 14 - Pregnancy, childbirth, puerperium
> 15 - Newborns and other neonates
> */
. 
. foreach d in 1 4 5 8 14 15 {
  2. preserve
  3.         
.         drop if lnprice_hcci_`d' == 0
  4.         bysort aha_hnpi: egen check = total(balanced) 
  5.         assert check == 5
  6.         drop check
  7. 
.         di "* * * * * * * * Output for MDC: `d' * * * * * * * *"
  8.         
.         *Average price and MDC price of MDC sample
.         tabstat price_hcci price_hcci_`d', by(Year) f(%5.2f)
  9. 
.         *Baseline Model
.         qui: reghdfe lnprice_hcci_`d' pen_both pen_one  i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4 y5 
> y6, absorb(provider_number fips) cluster(provider_number)
 10.         est store h_lnprice_hcci_`d'
 11.         esttab h_lnprice_hcci_`d', b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 
 12. 
.         * With separate trends
.         qui: reghdfe lnprice_hcci_`d' pen_both pen_one  y2 y3 y4 y5 y6 evY2 evY3 evY4 evY5 evY6  i.fips_power i.fips_size ${PRICE_VARS} ${COUNTY_V
> ARS} ${HOSPITAL_VARS} ${MKT} m_*, absorb(provider_number fips) cluster(provider_number)
 13.         est sto h_trend_lnprice_hcci_`d'
 14.         qui: test evY2 evY3 evY4 evY5 evY6
 15.         scalar lnprice_hcci_`d'_penalty=r(p)
 16.         esttab h_trend_lnprice_hcci_`d', b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01)
 17.         scalar list lnprice_hcci_`d'_penalty 
 18.         
.         * Market share triple diff for small markets
.         qui: reghdfe lnprice_hcci_`d' pen_one##i.fips_power1 pen_both##i.fips_power1  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4
>  y5 y6  if fips_power1~=., absorb(provider_number fips) cluster(provider_number)
 19.         est store h_lnprice_hcci_`d'
 20.         esttab h_lnprice_hcci_`d', b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 
 21.         est clear
 22.         * Market share triple diff for big markets
.         qui: reghdfe lnprice_hcci_`d' pen_one##i.fips_power2 pen_both##i.fips_power2  ${COUNTY_VARS} ${HOSPITAL_VARS} ${PRICE_VARS}  m_*  y2 y3 y4
>  y5 y6  if fips_power2~=., absorb(provider_number fips) cluster(provider_number)
 23.         est store h_lnprice_hcci_`d'
 24.         esttab h_lnprice_hcci_`d', b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 
 25.         est clear
 26.         
.         * Payer Mix triple diff
.         qui: reghdfe lnprice_hcci_`d'  pen_one pen_both ps2 ps3 ps4 ps_one* ps_both*  i.fips_power i.fips_size  ${COUNTY_VARS} ${HOSPITAL_VARS} ${
> PRICE_VARS}  m_*  y2 y3 y4 y5 y6  if fips_power~=., absorb(provider_number fips) cluster(provider_number)
 27.         est store h_lnprice_hcci_`d' 
 28.         esttab h_lnprice_hcci_`d' , b(%5.3f) se(%5.3f) star(* 0.1 ** 0.05 *** 0.01) 
 29.         est clear
 30. 
. restore
 31. }
(6,685 observations deleted)
* * * * * * * * Output for MDC: 1 * * * * * * * *

Summary statistics: mean
  by categories of: Year 

    Year |  price~ci  price_~1
---------+--------------------
    2010 |  10587.75  11299.32
    2011 |  11272.41  12744.25
    2012 |  11805.92  13210.76
    2013 |  12298.32  14062.88
    2014 |  12926.00  15161.85
---------+--------------------
   Total |  11778.08  13295.81
------------------------------

----------------------------
                      (1)   
             lnprice_hc~1   
----------------------------
pen_both            0.046*  
                  (0.025)   

pen_one             0.023   
                  (0.015)   

1.fips_power        0.017   
                  (0.042)   

2.fips_power        0.037   
                  (0.047)   

2.fips_size         0.029   
                  (0.025)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -1.128   
                  (3.194)   

Age_35to64         -1.832   
                  (3.610)   

Age_65plus          0.473   
                  (3.607)   

Race_White          0.125   
                  (0.555)   

Race_Black          0.148   
                  (1.898)   

Income_50~75       -0.699   
                  (1.678)   

Income_7~100       -0.387   
                  (1.502)   

Income_1~150       -0.899   
                  (1.377)   

Income_150~s       -0.230   
                  (1.132)   

Educ_HSGrad         0.034   
                  (1.308)   

Educ_Bach           1.000   
                  (2.028)   

teach1              0.020   
                  (0.027)   

teach2              0.028   
                  (0.020)   

System              0.011   
                  (0.042)   

Nonprofit          -0.092   
                  (0.059)   

Profit             -0.005   
                  (0.094)   

Labor_Nurse         0.000*  
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate          0.007   
                  (0.018)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.039   
                  (0.051)   

m_op               -0.004   
                  (0.020)   

y2                  0.118***
                  (0.016)   

y3                  0.152***
                  (0.025)   

y4                  0.175***
                  (0.037)   

y5                  0.241***
                  (0.047)   

y6                  0.000   
                      (.)   
----------------------------
N                    1615   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_hc~1   
----------------------------
pen_both            0.014   
                  (0.032)   

pen_one             0.005   
                  (0.019)   

y2                  0.117***
                  (0.034)   

y3                  0.096*  
                  (0.050)   

y4                  0.117** 
                  (0.056)   

y5                  0.195***
                  (0.066)   

y6                  0.000   
                      (.)   

evY2               -0.000   
                  (0.031)   

evY3                0.060   
                  (0.043)   

evY4                0.093*  
                  (0.051)   

evY5                0.079   
                  (0.056)   

evY6                0.000   
                      (.)   

1.fips_power        0.020   
                  (0.041)   

2.fips_power        0.035   
                  (0.046)   

2.fips_size         0.023   
                  (0.024)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -0.303   
                  (3.239)   

Age_35to64         -1.044   
                  (3.667)   

Age_65plus          0.798   
                  (3.588)   

Race_White         -0.061   
                  (0.564)   

Race_Black          0.113   
                  (1.898)   

Income_50~75       -0.562   
                  (1.668)   

Income_7~100       -0.080   
                  (1.510)   

Income_1~150       -0.751   
                  (1.380)   

Income_150~s        0.087   
                  (1.142)   

Educ_HSGrad         0.493   
                  (1.319)   

Educ_Bach           0.859   
                  (2.000)   

teach1              0.012   
                  (0.032)   

teach2              0.029   
                  (0.020)   

System              0.011   
                  (0.042)   

Nonprofit          -0.096   
                  (0.059)   

Profit             -0.014   
                  (0.092)   

Labor_Nurse         0.000*  
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate         -0.009   
                  (0.021)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.036   
                  (0.051)   

m_op               -0.005   
                  (0.020)   
----------------------------
N                    1615   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
lnprice_hcci_1_penalty =  .03724511

----------------------------
                      (1)   
             lnprice_hc~1   
----------------------------
1.pen_one          -0.047   
                  (0.061)   

1.fips_pow~1        0.015   
                  (0.059)   

2.fips_pow~1        0.010   
                  (0.079)   

1.pen_one#~1        0.052   
                  (0.051)   

1.pen_one#~1        0.159** 
                  (0.064)   

1.pen_both          0.006   
                  (0.062)   

1.pen_both~1       -0.100** 
                  (0.046)   

1.pen_both~1       -0.038   
                  (0.061)   

TotalPop            0.000   
                  (0.002)   

Age_18to34         -7.677   
                  (7.199)   

Age_35to64         -2.860   
                  (7.697)   

Age_65plus          3.928   
                  (6.954)   

Race_White         -0.430   
                  (1.801)   

Race_Black         -4.776   
                  (4.049)   

Income_50~75        0.032   
                  (2.434)   

Income_7~100       -1.921   
                  (2.237)   

Income_1~150        2.115   
                  (2.483)   

Income_150~s       -1.775   
                  (2.581)   

Educ_HSGrad         1.655   
                  (1.368)   

Educ_Bach           0.270   
                  (3.386)   

teach1              0.120*  
                  (0.062)   

teach2              0.030   
                  (0.047)   

System              0.053   
                  (0.072)   

Nonprofit           0.070   
                  (0.113)   

Profit              0.269*  
                  (0.159)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other         0.000   
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate         -0.016   
                  (0.053)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.000   
                      (.)   

m_op                0.007   
                  (0.034)   

y2                  0.106***
                  (0.039)   

y3                  0.141** 
                  (0.055)   

y4                  0.204** 
                  (0.085)   

y5                  0.258** 
                  (0.105)   

y6                  0.000   
                      (.)   
----------------------------
N                     298   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_hc~1   
----------------------------
1.pen_one           0.005   
                  (0.028)   

1.fips_pow~2        0.026   
                  (0.087)   

2.fips_pow~2        0.052   
                  (0.089)   

1.pen_one#~2        0.009   
                  (0.031)   

1.pen_one#~2        0.022   
                  (0.028)   

1.pen_both         -0.004   
                  (0.041)   

1.pen_both~2        0.072   
                  (0.046)   

1.pen_both~2        0.056   
                  (0.040)   

TotalPop            0.000   
                  (0.000)   

Age_18to34          2.935   
                  (4.135)   

Age_35to64          0.641   
                  (4.488)   

Age_65plus          1.818   
                  (4.411)   

Race_White          0.200   
                  (0.573)   

Race_Black          2.136   
                  (2.359)   

Income_50~75        1.274   
                  (2.315)   

Income_7~100        0.176   
                  (1.954)   

Income_1~150       -1.914   
                  (1.619)   

Income_150~s        0.844   
                  (1.268)   

Educ_HSGrad        -1.220   
                  (1.931)   

Educ_Bach           2.326   
                  (2.476)   

teach1              0.008   
                  (0.032)   

teach2              0.027   
                  (0.024)   

System             -0.003   
                  (0.046)   

Nonprofit           0.000   
                      (.)   

Profit             -0.016   
                  (0.030)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.003   
                  (0.019)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.044   
                  (0.052)   

m_op               -0.008   
                  (0.022)   

y2                  0.108***
                  (0.020)   

y3                  0.131***
                  (0.035)   

y4                  0.150***
                  (0.050)   

y5                  0.209***
                  (0.065)   

y6                  0.000   
                      (.)   
----------------------------
N                    1310   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_hc~1   
----------------------------
pen_one             0.040** 
                  (0.018)   

pen_both            0.081***
                  (0.029)   

ps2                 0.014   
                  (0.014)   

ps3                 0.043** 
                  (0.020)   

ps4                 0.040*  
                  (0.023)   

ps_one2            -0.010   
                  (0.022)   

ps_one3            -0.053** 
                  (0.021)   

ps_one4            -0.019   
                  (0.031)   

ps_both2           -0.073***
                  (0.027)   

ps_both3           -0.047   
                  (0.057)   

ps_both4           -0.046   
                  (0.036)   

1.fips_power        0.019   
                  (0.042)   

2.fips_power        0.044   
                  (0.048)   

2.fips_size         0.032   
                  (0.025)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -1.944   
                  (3.207)   

Age_35to64         -2.366   
                  (3.651)   

Age_65plus          0.482   
                  (3.586)   

Race_White          0.177   
                  (0.541)   

Race_Black         -0.169   
                  (1.830)   

Income_50~75       -0.895   
                  (1.739)   

Income_7~100       -0.571   
                  (1.485)   

Income_1~150       -0.904   
                  (1.349)   

Income_150~s       -0.800   
                  (1.140)   

Educ_HSGrad        -0.066   
                  (1.295)   

Educ_Bach           1.467   
                  (2.012)   

teach1              0.023   
                  (0.029)   

teach2              0.034*  
                  (0.020)   

System              0.002   
                  (0.040)   

Nonprofit          -0.042   
                  (0.055)   

Profit              0.046   
                  (0.087)   

Labor_Nurse         0.000*  
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate          0.006   
                  (0.018)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.042   
                  (0.049)   

m_op               -0.004   
                  (0.019)   

y2                  0.122***
                  (0.016)   

y3                  0.158***
                  (0.025)   

y4                  0.182***
                  (0.037)   

y5                  0.248***
                  (0.047)   

y6                  0.000   
                      (.)   
----------------------------
N                    1615   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
(6,215 observations deleted)
* * * * * * * * Output for MDC: 4 * * * * * * * *

Summary statistics: mean
  by categories of: Year 

    Year |  price~ci  price~_4
---------+--------------------
    2010 |  10006.15  10196.59
    2011 |  10638.69  11097.49
    2012 |  11176.46  11597.92
    2013 |  11662.87  12289.13
    2014 |  12220.08  12868.68
---------+--------------------
   Total |  11140.85  11609.96
------------------------------

----------------------------
                      (1)   
             lnprice_h~_4   
----------------------------
pen_both            0.033*  
                  (0.018)   

pen_one             0.003   
                  (0.012)   

1.fips_power        0.008   
                  (0.034)   

2.fips_power        0.028   
                  (0.040)   

2.fips_size        -0.009   
                  (0.020)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -3.198   
                  (2.560)   

Age_35to64         -1.727   
                  (2.759)   

Age_65plus          0.579   
                  (2.510)   

Race_White         -0.414   
                  (0.453)   

Race_Black          0.837   
                  (1.322)   

Income_50~75        0.585   
                  (1.096)   

Income_7~100        0.688   
                  (1.206)   

Income_1~150       -0.416   
                  (1.082)   

Income_150~s       -0.030   
                  (0.894)   

Educ_HSGrad        -1.363   
                  (1.002)   

Educ_Bach           0.623   
                  (1.357)   

teach1             -0.027   
                  (0.034)   

teach2              0.003   
                  (0.015)   

System              0.017   
                  (0.026)   

Nonprofit           0.070** 
                  (0.030)   

Profit              0.061*  
                  (0.034)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.030** 
                  (0.014)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.118   
                  (0.074)   

m_op                0.009   
                  (0.020)   

y2                  0.079***
                  (0.011)   

y3                  0.117***
                  (0.017)   

y4                  0.139***
                  (0.027)   

y5                  0.179***
                  (0.035)   

y6                  0.000   
                      (.)   
----------------------------
N                    2085   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~_4   
----------------------------
pen_both            0.009   
                  (0.024)   

pen_one            -0.011   
                  (0.014)   

y2                  0.063** 
                  (0.025)   

y3                  0.081** 
                  (0.033)   

y4                  0.102***
                  (0.036)   

y5                  0.121** 
                  (0.047)   

y6                  0.000   
                      (.)   

evY2                0.015   
                  (0.023)   

evY3                0.037   
                  (0.028)   

evY4                0.060*  
                  (0.035)   

evY5                0.080** 
                  (0.040)   

evY6                0.000   
                      (.)   

1.fips_power        0.010   
                  (0.034)   

2.fips_power        0.028   
                  (0.039)   

2.fips_size        -0.011   
                  (0.019)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -2.488   
                  (2.636)   

Age_35to64         -1.442   
                  (2.784)   

Age_65plus          0.811   
                  (2.508)   

Race_White         -0.527   
                  (0.457)   

Race_Black          0.894   
                  (1.320)   

Income_50~75        0.674   
                  (1.089)   

Income_7~100        0.713   
                  (1.203)   

Income_1~150       -0.328   
                  (1.087)   

Income_150~s        0.182   
                  (0.900)   

Educ_HSGrad        -1.090   
                  (1.021)   

Educ_Bach           0.644   
                  (1.337)   

teach1             -0.030   
                  (0.036)   

teach2              0.004   
                  (0.015)   

System              0.016   
                  (0.026)   

Nonprofit           0.067** 
                  (0.028)   

Profit              0.057*  
                  (0.033)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.017   
                  (0.017)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.117   
                  (0.075)   

m_op                0.008   
                  (0.020)   
----------------------------
N                    2085   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
lnprice_hcci_4_penalty =  .26346908

----------------------------
                      (1)   
             lnprice_h~_4   
----------------------------
1.pen_one           0.024   
                  (0.028)   

1.fips_pow~1        0.017   
                  (0.024)   

2.fips_pow~1        0.091   
                  (0.066)   

1.pen_one#~1       -0.035   
                  (0.029)   

1.pen_one#~1       -0.018   
                  (0.039)   

1.pen_both          0.008   
                  (0.037)   

1.pen_both~1        0.007   
                  (0.047)   

1.pen_both~1       -0.027   
                  (0.040)   

TotalPop            0.000   
                  (0.001)   

Age_18to34         -9.444*  
                  (5.037)   

Age_35to64         -7.011   
                  (4.501)   

Age_65plus          4.201   
                  (3.792)   

Race_White          0.526   
                  (0.964)   

Race_Black          2.582   
                  (2.227)   

Income_50~75        0.134   
                  (1.340)   

Income_7~100        0.860   
                  (1.638)   

Income_1~150        1.340   
                  (1.706)   

Income_150~s       -0.885   
                  (1.388)   

Educ_HSGrad        -1.419   
                  (1.421)   

Educ_Bach          -0.369   
                  (1.629)   

teach1             -0.088   
                  (0.074)   

teach2             -0.007   
                  (0.022)   

System              0.038   
                  (0.039)   

Nonprofit           0.112***
                  (0.042)   

Profit              0.152***
                  (0.052)   

Labor_Nurse         0.000*  
                  (0.000)   

Labor_Other        -0.000*  
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.012   
                  (0.024)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.000   
                      (.)   

m_op                0.023   
                  (0.042)   

y2                  0.054***
                  (0.019)   

y3                  0.072** 
                  (0.029)   

y4                  0.071*  
                  (0.041)   

y5                  0.111** 
                  (0.053)   

y6                  0.000   
                      (.)   
----------------------------
N                     645   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~_4   
----------------------------
1.pen_one           0.008   
                  (0.025)   

1.fips_pow~2        0.007   
                  (0.051)   

2.fips_pow~2        0.003   
                  (0.059)   

1.pen_one#~2       -0.035   
                  (0.025)   

1.pen_one#~2       -0.009   
                  (0.025)   

1.pen_both         -0.018   
                  (0.036)   

1.pen_both~2        0.058   
                  (0.044)   

1.pen_both~2        0.053   
                  (0.034)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -2.609   
                  (3.406)   

Age_35to64          0.857   
                  (4.024)   

Age_65plus          3.270   
                  (3.653)   

Race_White         -0.484   
                  (0.561)   

Race_Black          1.105   
                  (1.893)   

Income_50~75        4.235** 
                  (1.932)   

Income_7~100       -0.369   
                  (1.762)   

Income_1~150       -1.348   
                  (1.584)   

Income_150~s        1.339   
                  (1.292)   

Educ_HSGrad        -1.705   
                  (1.761)   

Educ_Bach           1.840   
                  (2.374)   

teach1             -0.005   
                  (0.034)   

teach2              0.010   
                  (0.020)   

System              0.003   
                  (0.034)   

Nonprofit           0.050   
                  (0.050)   

Profit              0.029   
                  (0.023)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000*  
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.027   
                  (0.020)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.114   
                  (0.084)   

m_op                0.003   
                  (0.022)   

y2                  0.084***
                  (0.016)   

y3                  0.122***
                  (0.026)   

y4                  0.165***
                  (0.040)   

y5                  0.192***
                  (0.051)   

y6                  0.000   
                      (.)   
----------------------------
N                    1422   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~_4   
----------------------------
pen_one             0.017   
                  (0.014)   

pen_both            0.080***
                  (0.023)   

ps2                 0.010   
                  (0.012)   

ps3                 0.048***
                  (0.017)   

ps4                 0.043** 
                  (0.021)   

ps_one2            -0.024   
                  (0.017)   

ps_one3            -0.016   
                  (0.020)   

ps_one4            -0.023   
                  (0.020)   

ps_both2           -0.065***
                  (0.023)   

ps_both3           -0.057*  
                  (0.033)   

ps_both4           -0.090***
                  (0.031)   

1.fips_power        0.008   
                  (0.032)   

2.fips_power        0.031   
                  (0.039)   

2.fips_size        -0.007   
                  (0.021)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -3.899   
                  (2.518)   

Age_35to64         -2.315   
                  (2.737)   

Age_65plus          1.303   
                  (2.441)   

Race_White         -0.294   
                  (0.429)   

Race_Black          0.797   
                  (1.276)   

Income_50~75        0.557   
                  (1.058)   

Income_7~100        0.749   
                  (1.172)   

Income_1~150       -0.196   
                  (1.035)   

Income_150~s       -0.421   
                  (0.864)   

Educ_HSGrad        -1.417   
                  (0.981)   

Educ_Bach           0.744   
                  (1.322)   

teach1             -0.023   
                  (0.036)   

teach2              0.003   
                  (0.015)   

System              0.012   
                  (0.026)   

Nonprofit           0.070** 
                  (0.029)   

Profit              0.070** 
                  (0.031)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.032** 
                  (0.014)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.124*  
                  (0.073)   

m_op                0.011   
                  (0.019)   

y2                  0.081***
                  (0.011)   

y3                  0.121***
                  (0.017)   

y4                  0.139***
                  (0.026)   

y5                  0.179***
                  (0.034)   

y6                  0.000   
                      (.)   
----------------------------
N                    2085   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
(5,315 observations deleted)
* * * * * * * * Output for MDC: 5 * * * * * * * *

Summary statistics: mean
  by categories of: Year 

    Year |  price~ci  price~_5
---------+--------------------
    2010 |  10249.37  11433.98
    2011 |  10941.45  12156.49
    2012 |  11507.19  12857.04
    2013 |  11912.85  13642.35
    2014 |  12456.45  14022.26
---------+--------------------
   Total |  11413.46  12822.42
------------------------------

----------------------------
                      (1)   
             lnprice_h~_5   
----------------------------
pen_both            0.040***
                  (0.015)   

pen_one             0.016   
                  (0.010)   

1.fips_power        0.014   
                  (0.022)   

2.fips_power        0.021   
                  (0.028)   

2.fips_size        -0.041   
                  (0.027)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -2.568   
                  (1.657)   

Age_35to64          1.218   
                  (1.973)   

Age_65plus         -0.725   
                  (1.818)   

Race_White         -0.503   
                  (0.471)   

Race_Black          1.701   
                  (1.218)   

Income_50~75        0.751   
                  (0.744)   

Income_7~100        0.030   
                  (0.996)   

Income_1~150       -1.870** 
                  (0.869)   

Income_150~s        1.108*  
                  (0.646)   

Educ_HSGrad         0.925   
                  (0.800)   

Educ_Bach           1.914** 
                  (0.944)   

teach1              0.041   
                  (0.027)   

teach2             -0.018   
                  (0.012)   

System             -0.038*  
                  (0.022)   

Nonprofit           0.135*  
                  (0.075)   

Profit              0.088   
                  (0.081)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000*  
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.024** 
                  (0.010)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.020   
                  (0.049)   

m_op                0.013   
                  (0.014)   

y2                  0.064***
                  (0.009)   

y3                  0.126***
                  (0.014)   

y4                  0.150***
                  (0.022)   

y5                  0.184***
                  (0.028)   

y6                  0.000   
                      (.)   
----------------------------
N                    2985   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~_5   
----------------------------
pen_both            0.018   
                  (0.019)   

pen_one             0.001   
                  (0.012)   

y2                  0.064***
                  (0.016)   

y3                  0.095***
                  (0.023)   

y4                  0.123***
                  (0.030)   

y5                  0.127***
                  (0.037)   

y6                  0.000   
                      (.)   

evY2               -0.001   
                  (0.015)   

evY3                0.032   
                  (0.020)   

evY4                0.048*  
                  (0.028)   

evY5                0.080***
                  (0.030)   

evY6                0.000   
                      (.)   

1.fips_power        0.015   
                  (0.022)   

2.fips_power        0.021   
                  (0.027)   

2.fips_size        -0.043   
                  (0.027)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -2.077   
                  (1.680)   

Age_35to64          1.586   
                  (1.990)   

Age_65plus         -0.560   
                  (1.820)   

Race_White         -0.596   
                  (0.484)   

Race_Black          1.646   
                  (1.215)   

Income_50~75        0.813   
                  (0.739)   

Income_7~100        0.098   
                  (0.996)   

Income_1~150       -1.814** 
                  (0.876)   

Income_150~s        1.289** 
                  (0.651)   

Educ_HSGrad         1.064   
                  (0.800)   

Educ_Bach           1.879** 
                  (0.939)   

teach1              0.037   
                  (0.028)   

teach2             -0.018   
                  (0.012)   

System             -0.038*  
                  (0.022)   

Nonprofit           0.135*  
                  (0.075)   

Profit              0.087   
                  (0.082)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.014   
                  (0.011)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.018   
                  (0.049)   

m_op                0.013   
                  (0.014)   
----------------------------
N                    2985   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
lnprice_hcci_5_penalty =  .06327554

----------------------------
                      (1)   
             lnprice_h~_5   
----------------------------
1.pen_one          -0.008   
                  (0.028)   

1.fips_pow~1        0.005   
                  (0.034)   

2.fips_pow~1        0.022   
                  (0.054)   

1.pen_one#~1        0.002   
                  (0.030)   

1.pen_one#~1        0.026   
                  (0.030)   

1.pen_both         -0.004   
                  (0.031)   

1.pen_both~1        0.010   
                  (0.032)   

1.pen_both~1       -0.054   
                  (0.036)   

TotalPop            0.001** 
                  (0.001)   

Age_18to34         -3.674   
                  (2.637)   

Age_35to64          0.649   
                  (2.991)   

Age_65plus         -1.377   
                  (2.445)   

Race_White          0.025   
                  (0.776)   

Race_Black          1.666   
                  (1.911)   

Income_50~75        1.197   
                  (0.878)   

Income_7~100        1.071   
                  (1.364)   

Income_1~150       -1.063   
                  (1.278)   

Income_150~s        0.271   
                  (1.015)   

Educ_HSGrad         0.997   
                  (0.988)   

Educ_Bach           1.435   
                  (1.245)   

teach1              0.048   
                  (0.043)   

teach2              0.003   
                  (0.020)   

System             -0.048   
                  (0.033)   

Nonprofit           0.167*  
                  (0.089)   

Profit              0.231** 
                  (0.097)   

Labor_Nurse         0.000*  
                  (0.000)   

Labor_Other         0.000*  
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate         -0.012   
                  (0.017)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.000   
                      (.)   

m_op                0.009   
                  (0.026)   

y2                  0.051***
                  (0.015)   

y3                  0.113***
                  (0.023)   

y4                  0.181***
                  (0.036)   

y5                  0.209***
                  (0.047)   

y6                  0.000   
                      (.)   
----------------------------
N                    1013   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~_5   
----------------------------
1.pen_one           0.032   
                  (0.021)   

1.fips_pow~2        0.007   
                  (0.050)   

2.fips_pow~2       -0.011   
                  (0.054)   

1.pen_one#~2       -0.027   
                  (0.021)   

1.pen_one#~2       -0.014   
                  (0.021)   

1.pen_both          0.058** 
                  (0.028)   

1.pen_both~2       -0.008   
                  (0.029)   

1.pen_both~2        0.005   
                  (0.027)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34          0.807   
                  (2.290)   

Age_35to64          3.535   
                  (2.795)   

Age_65plus          5.327*  
                  (3.019)   

Race_White         -0.322   
                  (0.543)   

Race_Black          3.323** 
                  (1.606)   

Income_50~75        2.091   
                  (1.443)   

Income_7~100       -2.157   
                  (1.393)   

Income_1~150       -0.495   
                  (1.301)   

Income_150~s        2.150** 
                  (0.884)   

Educ_HSGrad         0.819   
                  (1.204)   

Educ_Bach           2.121   
                  (1.547)   

teach1              0.051*  
                  (0.031)   

teach2             -0.031** 
                  (0.014)   

System             -0.057** 
                  (0.026)   

Nonprofit           0.171   
                  (0.115)   

Profit              0.088   
                  (0.113)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000***
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.039***
                  (0.012)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.020   
                  (0.050)   

m_op                0.015   
                  (0.016)   

y2                  0.054***
                  (0.013)   

y3                  0.101***
                  (0.023)   

y4                  0.098***
                  (0.033)   

y5                  0.120***
                  (0.042)   

y6                  0.000   
                      (.)   
----------------------------
N                    1945   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~_5   
----------------------------
pen_one             0.025** 
                  (0.012)   

pen_both            0.064***
                  (0.019)   

ps2                -0.008   
                  (0.011)   

ps3                 0.006   
                  (0.012)   

ps4                 0.014   
                  (0.015)   

ps_one2            -0.009   
                  (0.015)   

ps_one3            -0.016   
                  (0.014)   

ps_one4            -0.019   
                  (0.017)   

ps_both2           -0.023   
                  (0.017)   

ps_both3           -0.018   
                  (0.028)   

ps_both4           -0.070***
                  (0.022)   

1.fips_power        0.013   
                  (0.022)   

2.fips_power        0.023   
                  (0.028)   

2.fips_size        -0.042   
                  (0.027)   

TotalPop           -0.000   
                  (0.000)   

Age_18to34         -3.144*  
                  (1.634)   

Age_35to64          0.902   
                  (1.940)   

Age_65plus         -0.615   
                  (1.776)   

Race_White         -0.456   
                  (0.473)   

Race_Black          1.621   
                  (1.203)   

Income_50~75        0.794   
                  (0.736)   

Income_7~100       -0.006   
                  (0.997)   

Income_1~150       -1.779** 
                  (0.867)   

Income_150~s        0.949   
                  (0.652)   

Educ_HSGrad         1.002   
                  (0.811)   

Educ_Bach           1.992** 
                  (0.942)   

teach1              0.038   
                  (0.026)   

teach2             -0.017   
                  (0.012)   

System             -0.041*  
                  (0.022)   

Nonprofit           0.131*  
                  (0.072)   

Profit              0.088   
                  (0.079)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate          0.025** 
                  (0.010)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.022   
                  (0.049)   

m_op                0.015   
                  (0.014)   

y2                  0.066***
                  (0.009)   

y3                  0.130***
                  (0.014)   

y4                  0.154***
                  (0.022)   

y5                  0.188***
                  (0.028)   

y6                  0.000   
                      (.)   
----------------------------
N                    2985   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
(5,005 observations deleted)
* * * * * * * * Output for MDC: 8 * * * * * * * *

Summary statistics: mean
  by categories of: Year 

    Year |  price~ci  price_~8
---------+--------------------
    2010 |  10412.65  11689.43
    2011 |  11087.26  12160.76
    2012 |  11611.12  12687.90
    2013 |  12037.72  13389.80
    2014 |  12634.57  13724.57
---------+--------------------
   Total |  11556.67  12730.49
------------------------------

----------------------------
                      (1)   
             lnprice_hc~8   
----------------------------
pen_both            0.026*  
                  (0.014)   

pen_one             0.016*  
                  (0.010)   

1.fips_power        0.010   
                  (0.021)   

2.fips_power       -0.017   
                  (0.031)   

2.fips_size        -0.034*  
                  (0.017)   

TotalPop            0.000   
                  (0.000)   

Age_18to34          0.620   
                  (1.834)   

Age_35to64          1.472   
                  (2.120)   

Age_65plus          1.074   
                  (1.778)   

Race_White         -0.251   
                  (0.344)   

Race_Black         -0.642   
                  (1.255)   

Income_50~75       -0.086   
                  (0.701)   

Income_7~100       -0.773   
                  (0.819)   

Income_1~150       -1.295*  
                  (0.783)   

Income_150~s       -0.083   
                  (0.695)   

Educ_HSGrad         0.714   
                  (0.714)   

Educ_Bach           2.309** 
                  (1.006)   

teach1              0.020   
                  (0.034)   

teach2              0.012   
                  (0.012)   

System             -0.017   
                  (0.018)   

Nonprofit           0.216** 
                  (0.098)   

Profit              0.200** 
                  (0.088)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.008   
                  (0.010)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.063***
                  (0.024)   

m_p_d               0.048   
                  (0.053)   

m_op                0.009   
                  (0.014)   

y2                  0.041***
                  (0.009)   

y3                  0.081***
                  (0.015)   

y4                  0.106***
                  (0.023)   

y5                  0.127***
                  (0.030)   

y6                  0.000   
                      (.)   
----------------------------
N                    3295   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_hc~8   
----------------------------
pen_both            0.012   
                  (0.017)   

pen_one             0.007   
                  (0.011)   

y2                  0.050***
                  (0.017)   

y3                  0.075***
                  (0.025)   

y4                  0.084***
                  (0.031)   

y5                  0.114***
                  (0.039)   

y6                  0.000   
                      (.)   

evY2               -0.010   
                  (0.015)   

evY3                0.007   
                  (0.022)   

evY4                0.036   
                  (0.028)   

evY5                0.028   
                  (0.032)   

evY6                0.000   
                      (.)   

1.fips_power        0.010   
                  (0.021)   

2.fips_power       -0.018   
                  (0.031)   

2.fips_size        -0.035** 
                  (0.017)   

TotalPop            0.000   
                  (0.000)   

Age_18to34          0.963   
                  (1.852)   

Age_35to64          1.727   
                  (2.119)   

Age_65plus          1.162   
                  (1.783)   

Race_White         -0.308   
                  (0.345)   

Race_Black         -0.681   
                  (1.253)   

Income_50~75       -0.017   
                  (0.703)   

Income_7~100       -0.714   
                  (0.828)   

Income_1~150       -1.269   
                  (0.786)   

Income_150~s       -0.000   
                  (0.697)   

Educ_HSGrad         0.828   
                  (0.724)   

Educ_Bach           2.292** 
                  (1.006)   

teach1              0.018   
                  (0.034)   

teach2              0.012   
                  (0.012)   

System             -0.018   
                  (0.018)   

Nonprofit           0.217** 
                  (0.098)   

Profit              0.200** 
                  (0.089)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.001   
                  (0.011)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.058** 
                  (0.024)   

m_p_d               0.048   
                  (0.054)   

m_op                0.008   
                  (0.014)   
----------------------------
N                    3295   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
lnprice_hcci_8_penalty =  .44090844

----------------------------
                      (1)   
             lnprice_hc~8   
----------------------------
1.pen_one          -0.012   
                  (0.020)   

1.fips_pow~1       -0.013   
                  (0.022)   

2.fips_pow~1       -0.063*  
                  (0.035)   

1.pen_one#~1        0.036*  
                  (0.020)   

1.pen_one#~1        0.062** 
                  (0.025)   

1.pen_both         -0.009   
                  (0.031)   

1.pen_both~1       -0.013   
                  (0.028)   

1.pen_both~1        0.018   
                  (0.038)   

TotalPop            0.001*  
                  (0.001)   

Age_18to34         -0.492   
                  (2.910)   

Age_35to64          1.751   
                  (3.195)   

Age_65plus          2.438   
                  (2.350)   

Race_White         -0.624   
                  (0.691)   

Race_Black          1.037   
                  (2.483)   

Income_50~75        0.272   
                  (0.844)   

Income_7~100       -0.293   
                  (1.045)   

Income_1~150       -1.338   
                  (1.161)   

Income_150~s       -1.012   
                  (1.194)   

Educ_HSGrad         0.842   
                  (0.847)   

Educ_Bach           1.725   
                  (1.232)   

teach1              0.068   
                  (0.066)   

teach2             -0.006   
                  (0.022)   

System             -0.030   
                  (0.032)   

Nonprofit           0.147   
                  (0.138)   

Profit              0.143   
                  (0.134)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate         -0.011   
                  (0.017)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.063*  
                  (0.038)   

m_p_d               0.000   
                      (.)   

m_op                0.012   
                  (0.027)   

y2                  0.046***
                  (0.014)   

y3                  0.085***
                  (0.022)   

y4                  0.114***
                  (0.035)   

y5                  0.139***
                  (0.045)   

y6                  0.000   
                      (.)   
----------------------------
N                    1138   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_hc~8   
----------------------------
1.pen_one           0.024   
                  (0.020)   

1.fips_pow~2       -0.025   
                  (0.026)   

2.fips_pow~2       -0.025   
                  (0.031)   

1.pen_one#~2       -0.017   
                  (0.021)   

1.pen_one#~2       -0.018   
                  (0.020)   

1.pen_both          0.020   
                  (0.025)   

1.pen_both~2        0.012   
                  (0.024)   

1.pen_both~2        0.032   
                  (0.024)   

TotalPop            0.000   
                  (0.000)   

Age_18to34          1.269   
                  (2.628)   

Age_35to64          0.163   
                  (3.096)   

Age_65plus         -0.397   
                  (3.032)   

Race_White          0.150   
                  (0.407)   

Race_Black         -0.398   
                  (1.439)   

Income_50~75        0.512   
                  (1.469)   

Income_7~100       -2.465*  
                  (1.447)   

Income_1~150       -1.023   
                  (1.307)   

Income_150~s       -0.259   
                  (1.010)   

Educ_HSGrad         0.269   
                  (1.327)   

Educ_Bach           3.311*  
                  (1.793)   

teach1              0.020   
                  (0.032)   

teach2              0.022   
                  (0.013)   

System             -0.005   
                  (0.022)   

Nonprofit           0.312***
                  (0.026)   

Profit              0.290***
                  (0.023)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.024*  
                  (0.013)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.049   
                  (0.053)   

m_op                0.003   
                  (0.015)   

y2                  0.039***
                  (0.013)   

y3                  0.075***
                  (0.025)   

y4                  0.098***
                  (0.037)   

y5                  0.120** 
                  (0.049)   

y6                  0.000   
                      (.)   
----------------------------
N                    2131   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_hc~8   
----------------------------
pen_one             0.023*  
                  (0.012)   

pen_both            0.048***
                  (0.018)   

ps2                 0.007   
                  (0.010)   

ps3                 0.014   
                  (0.011)   

ps4                 0.013   
                  (0.014)   

ps_one2            -0.013   
                  (0.014)   

ps_one3            -0.002   
                  (0.014)   

ps_one4            -0.016   
                  (0.019)   

ps_both2           -0.037** 
                  (0.018)   

ps_both3           -0.022   
                  (0.023)   

ps_both4           -0.042*  
                  (0.023)   

1.fips_power        0.011   
                  (0.021)   

2.fips_power       -0.016   
                  (0.031)   

2.fips_size        -0.034*  
                  (0.018)   

TotalPop            0.000   
                  (0.000)   

Age_18to34          0.407   
                  (1.841)   

Age_35to64          1.344   
                  (2.120)   

Age_65plus          1.175   
                  (1.768)   

Race_White         -0.229   
                  (0.345)   

Race_Black         -0.633   
                  (1.255)   

Income_50~75       -0.083   
                  (0.705)   

Income_7~100       -0.750   
                  (0.815)   

Income_1~150       -1.268   
                  (0.779)   

Income_150~s       -0.193   
                  (0.704)   

Educ_HSGrad         0.719   
                  (0.709)   

Educ_Bach           2.303** 
                  (0.990)   

teach1              0.021   
                  (0.034)   

teach2              0.012   
                  (0.012)   

System             -0.018   
                  (0.018)   

Nonprofit           0.218** 
                  (0.095)   

Profit              0.204** 
                  (0.087)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.008   
                  (0.010)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.053** 
                  (0.025)   

m_p_d               0.051   
                  (0.053)   

m_op                0.009   
                  (0.014)   

y2                  0.042***
                  (0.009)   

y3                  0.083***
                  (0.015)   

y4                  0.108***
                  (0.023)   

y5                  0.130***
                  (0.030)   

y6                  0.000   
                      (.)   
----------------------------
N                    3295   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
(3,020 observations deleted)
* * * * * * * * Output for MDC: 14 * * * * * * * *

Summary statistics: mean
  by categories of: Year 

    Year |  price~ci  price~14
---------+--------------------
    2010 |  10679.31  10427.54
    2011 |  11328.69  10753.16
    2012 |  11912.51  11244.60
    2013 |  12265.58  11259.14
    2014 |  12900.68  12255.78
---------+--------------------
   Total |  11817.35  11188.04
------------------------------

----------------------------
                      (1)   
             lnprice_h~14   
----------------------------
pen_both            0.014   
                  (0.012)   

pen_one             0.009   
                  (0.008)   

1.fips_power       -0.007   
                  (0.015)   

2.fips_power       -0.041*  
                  (0.022)   

2.fips_size        -0.091** 
                  (0.046)   

TotalPop            0.000***
                  (0.000)   

Age_18to34         -1.550   
                  (1.358)   

Age_35to64         -0.415   
                  (1.724)   

Age_65plus         -0.280   
                  (1.417)   

Race_White         -0.369   
                  (0.292)   

Race_Black         -1.619*  
                  (0.877)   

Income_50~75       -0.666   
                  (0.514)   

Income_7~100       -0.459   
                  (0.531)   

Income_1~150       -0.053   
                  (0.495)   

Income_150~s        0.353   
                  (0.536)   

Educ_HSGrad        -0.032   
                  (0.446)   

Educ_Bach           0.031   
                  (0.675)   

teach1             -0.004   
                  (0.023)   

teach2              0.006   
                  (0.008)   

System              0.031   
                  (0.022)   

Nonprofit           0.088   
                  (0.104)   

Profit              0.128   
                  (0.135)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.009   
                  (0.009)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse           -0.473***
                  (0.127)   

m_lother            0.065   
                  (0.126)   

m_p_d               0.062*  
                  (0.033)   

m_op                0.014   
                  (0.011)   

y2                  0.024***
                  (0.006)   

y3                  0.061***
                  (0.010)   

y4                  0.037** 
                  (0.017)   

y5                  0.115***
                  (0.022)   

y6                  0.000   
                      (.)   
----------------------------
N                    5278   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~14   
----------------------------
pen_both            0.005   
                  (0.012)   

pen_one             0.003   
                  (0.008)   

y2                  0.050***
                  (0.014)   

y3                  0.050** 
                  (0.020)   

y4                  0.029   
                  (0.027)   

y5                  0.096***
                  (0.034)   

y6                  0.000   
                      (.)   

evY2               -0.027** 
                  (0.013)   

evY3                0.011   
                  (0.019)   

evY4                0.016   
                  (0.026)   

evY5                0.028   
                  (0.030)   

evY6                0.000   
                      (.)   

1.fips_power       -0.007   
                  (0.015)   

2.fips_power       -0.041*  
                  (0.022)   

2.fips_size        -0.092** 
                  (0.046)   

TotalPop            0.000***
                  (0.000)   

Age_18to34         -1.393   
                  (1.368)   

Age_35to64         -0.294   
                  (1.736)   

Age_65plus         -0.211   
                  (1.414)   

Race_White         -0.395   
                  (0.294)   

Race_Black         -1.652*  
                  (0.878)   

Income_50~75       -0.637   
                  (0.514)   

Income_7~100       -0.446   
                  (0.531)   

Income_1~150       -0.058   
                  (0.495)   

Income_150~s        0.401   
                  (0.537)   

Educ_HSGrad         0.019   
                  (0.450)   

Educ_Bach           0.054   
                  (0.674)   

teach1             -0.007   
                  (0.023)   

teach2              0.006   
                  (0.008)   

System              0.030   
                  (0.023)   

Nonprofit           0.088   
                  (0.104)   

Profit              0.127   
                  (0.135)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.005   
                  (0.009)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse           -0.473***
                  (0.130)   

m_lother            0.064   
                  (0.128)   

m_p_d               0.063*  
                  (0.033)   

m_op                0.014   
                  (0.011)   
----------------------------
N                    5278   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
lnprice_hcci_14_penalty =  .01803467

----------------------------
                      (1)   
             lnprice_h~14   
----------------------------
1.pen_one           0.002   
                  (0.014)   

1.fips_pow~1        0.004   
                  (0.013)   

2.fips_pow~1        0.009   
                  (0.020)   

1.pen_one#~1       -0.004   
                  (0.015)   

1.pen_one#~1        0.004   
                  (0.016)   

1.pen_both          0.016   
                  (0.020)   

1.pen_both~1       -0.020   
                  (0.017)   

1.pen_both~1       -0.039** 
                  (0.019)   

TotalPop            0.000   
                  (0.000)   

Age_18to34         -3.324*  
                  (1.780)   

Age_35to64         -2.760   
                  (1.860)   

Age_65plus          2.499   
                  (1.531)   

Race_White         -0.571   
                  (0.437)   

Race_Black         -1.043   
                  (1.176)   

Income_50~75       -0.438   
                  (0.592)   

Income_7~100       -0.712   
                  (0.609)   

Income_1~150        0.669   
                  (0.608)   

Income_150~s       -0.415   
                  (0.669)   

Educ_HSGrad        -0.000   
                  (0.501)   

Educ_Bach          -0.447   
                  (0.776)   

teach1              0.032   
                  (0.033)   

teach2              0.012   
                  (0.011)   

System             -0.020   
                  (0.013)   

Nonprofit          -0.033   
                  (0.053)   

Profit             -0.002   
                  (0.059)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other         0.000   
                  (0.000)   

Beds               -0.000   
                  (0.000)   

vbp_rebate         -0.005   
                  (0.012)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse           -0.477***
                  (0.095)   

m_lother            0.108   
                  (0.092)   

m_p_d               0.000   
                      (.)   

m_op                0.032*  
                  (0.018)   

y2                  0.021***
                  (0.008)   

y3                  0.040***
                  (0.013)   

y4                  0.032   
                  (0.023)   

y5                  0.097***
                  (0.028)   

y6                  0.000   
                      (.)   
----------------------------
N                    2428   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~14   
----------------------------
1.pen_one           0.002   
                  (0.015)   

1.fips_pow~2       -0.004   
                  (0.018)   

2.fips_pow~2       -0.005   
                  (0.023)   

1.pen_one#~2       -0.001   
                  (0.015)   

1.pen_one#~2        0.018   
                  (0.015)   

1.pen_both          0.016   
                  (0.022)   

1.pen_both~2        0.010   
                  (0.019)   

1.pen_both~2        0.009   
                  (0.020)   

TotalPop            0.000***
                  (0.000)   

Age_18to34         -0.271   
                  (2.144)   

Age_35to64         -0.401   
                  (2.467)   

Age_65plus         -2.975   
                  (2.338)   

Race_White         -0.172   
                  (0.291)   

Race_Black          0.296   
                  (1.050)   

Income_50~75        0.153   
                  (1.018)   

Income_7~100       -1.439   
                  (1.047)   

Income_1~150       -0.928   
                  (0.879)   

Income_150~s        0.750   
                  (0.853)   

Educ_HSGrad         0.339   
                  (0.931)   

Educ_Bach           1.332   
                  (1.309)   

teach1             -0.019   
                  (0.027)   

teach2              0.001   
                  (0.011)   

System              0.037*  
                  (0.020)   

Nonprofit           0.094   
                  (0.125)   

Profit              0.068   
                  (0.103)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.017   
                  (0.011)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d               0.053   
                  (0.033)   

m_op                0.003   
                  (0.012)   

y2                  0.029***
                  (0.009)   

y3                  0.071***
                  (0.016)   

y4                  0.041   
                  (0.028)   

y5                  0.124***
                  (0.035)   

y6                  0.000   
                      (.)   
----------------------------
N                    2808   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~14   
----------------------------
pen_one             0.021** 
                  (0.010)   

pen_both            0.044***
                  (0.015)   

ps2                 0.005   
                  (0.007)   

ps3                 0.013   
                  (0.008)   

ps4                 0.009   
                  (0.010)   

ps_one2            -0.006   
                  (0.011)   

ps_one3            -0.029** 
                  (0.012)   

ps_one4            -0.019   
                  (0.013)   

ps_both2           -0.036***
                  (0.014)   

ps_both3           -0.065***
                  (0.015)   

ps_both4           -0.039***
                  (0.014)   

1.fips_power       -0.006   
                  (0.015)   

2.fips_power       -0.037   
                  (0.022)   

2.fips_size        -0.090** 
                  (0.045)   

TotalPop            0.000***
                  (0.000)   

Age_18to34         -1.828   
                  (1.360)   

Age_35to64         -0.718   
                  (1.708)   

Age_65plus         -0.198   
                  (1.407)   

Race_White         -0.337   
                  (0.288)   

Race_Black         -1.653*  
                  (0.863)   

Income_50~75       -0.722   
                  (0.511)   

Income_7~100       -0.497   
                  (0.528)   

Income_1~150       -0.125   
                  (0.493)   

Income_150~s        0.235   
                  (0.525)   

Educ_HSGrad        -0.019   
                  (0.438)   

Educ_Bach           0.049   
                  (0.666)   

teach1             -0.005   
                  (0.023)   

teach2              0.006   
                  (0.008)   

System              0.030   
                  (0.022)   

Nonprofit           0.087   
                  (0.104)   

Profit              0.128   
                  (0.135)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000   
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.008   
                  (0.009)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse           -0.470***
                  (0.125)   

m_lother            0.068   
                  (0.123)   

m_p_d               0.062*  
                  (0.032)   

m_op                0.014   
                  (0.011)   

y2                  0.026***
                  (0.006)   

y3                  0.063***
                  (0.010)   

y4                  0.040** 
                  (0.017)   

y5                  0.118***
                  (0.022)   

y6                  0.000   
                      (.)   
----------------------------
N                    5278   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
(4,995 observations deleted)
* * * * * * * * Output for MDC: 15 * * * * * * * *

Summary statistics: mean
  by categories of: Year 

    Year |  price~ci  price~15
---------+--------------------
    2010 |  10468.92   7421.27
    2011 |  11157.06   8886.81
    2012 |  11654.44   9309.12
    2013 |  12018.96   9678.43
    2014 |  12685.61   9862.95
---------+--------------------
   Total |  11597.00   9031.72
------------------------------

----------------------------
                      (1)   
             lnprice_h~15   
----------------------------
pen_both            0.085***
                  (0.029)   

pen_one             0.054***
                  (0.017)   

1.fips_power       -0.002   
                  (0.028)   

2.fips_power       -0.009   
                  (0.038)   

2.fips_size        -0.027   
                  (0.031)   

TotalPop            0.000   
                  (0.000)   

Age_18to34         -2.760   
                  (3.130)   

Age_35to64         -4.974   
                  (3.551)   

Age_65plus         -3.875   
                  (2.891)   

Race_White          0.524   
                  (0.627)   

Race_Black         -2.705   
                  (1.859)   

Income_50~75       -1.773   
                  (1.299)   

Income_7~100       -0.777   
                  (1.209)   

Income_1~150       -4.742***
                  (1.176)   

Income_150~s        0.537   
                  (1.277)   

Educ_HSGrad         0.864   
                  (1.176)   

Educ_Bach          -0.975   
                  (1.559)   

teach1             -0.006   
                  (0.056)   

teach2              0.025*  
                  (0.015)   

System             -0.018   
                  (0.028)   

Nonprofit          -0.125***
                  (0.046)   

Profit             -0.028   
                  (0.044)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000***
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.036*  
                  (0.019)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.185***
                  (0.043)   

m_p_d               0.001   
                  (0.054)   

m_op                0.002   
                  (0.028)   

y2                  0.204***
                  (0.015)   

y3                  0.257***
                  (0.022)   

y4                  0.222***
                  (0.040)   

y5                  0.246***
                  (0.046)   

y6                  0.000   
                      (.)   
----------------------------
N                    3305   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~15   
----------------------------
pen_both            0.026   
                  (0.025)   

pen_one             0.016   
                  (0.015)   

y2                  0.229***
                  (0.048)   

y3                  0.143** 
                  (0.055)   

y4                  0.070   
                  (0.074)   

y5                  0.093   
                  (0.077)   

y6                  0.000   
                      (.)   

evY2               -0.027   
                  (0.048)   

evY3                0.119** 
                  (0.054)   

evY4                0.213***
                  (0.068)   

evY5                0.212***
                  (0.068)   

evY6                0.000   
                      (.)   

1.fips_power        0.000   
                  (0.028)   

2.fips_power       -0.005   
                  (0.038)   

2.fips_size        -0.033   
                  (0.031)   

TotalPop            0.000   
                  (0.000)   

Age_18to34         -1.205   
                  (2.987)   

Age_35to64         -3.578   
                  (3.418)   

Age_65plus         -3.527   
                  (2.877)   

Race_White          0.245   
                  (0.634)   

Race_Black         -2.693   
                  (1.825)   

Income_50~75       -1.511   
                  (1.311)   

Income_7~100       -0.555   
                  (1.204)   

Income_1~150       -4.455***
                  (1.157)   

Income_150~s        1.000   
                  (1.277)   

Educ_HSGrad         1.599   
                  (1.108)   

Educ_Bach          -0.773   
                  (1.540)   

teach1             -0.021   
                  (0.056)   

teach2              0.025*  
                  (0.015)   

System             -0.019   
                  (0.029)   

Nonprofit          -0.124***
                  (0.044)   

Profit             -0.032   
                  (0.043)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000***
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.008   
                  (0.017)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.207***
                  (0.043)   

m_p_d               0.002   
                  (0.054)   

m_op                0.003   
                  (0.027)   
----------------------------
N                    3305   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01
lnprice_hcci_15_penalty =  .00001185

----------------------------
                      (1)   
             lnprice_h~15   
----------------------------
1.pen_one           0.043   
                  (0.033)   

1.fips_pow~1        0.014   
                  (0.025)   

2.fips_pow~1       -0.066   
                  (0.049)   

1.pen_one#~1       -0.012   
                  (0.030)   

1.pen_one#~1        0.023   
                  (0.032)   

1.pen_both          0.088*  
                  (0.047)   

1.pen_both~1       -0.052   
                  (0.041)   

1.pen_both~1       -0.013   
                  (0.053)   

TotalPop            0.001   
                  (0.001)   

Age_18to34         -6.945   
                  (4.476)   

Age_35to64         -7.097   
                  (5.303)   

Age_65plus         -3.637   
                  (3.925)   

Race_White         -2.042** 
                  (0.985)   

Race_Black         -8.666***
                  (2.268)   

Income_50~75        0.608   
                  (1.497)   

Income_7~100       -0.847   
                  (1.366)   

Income_1~150       -2.879*  
                  (1.546)   

Income_150~s       -0.796   
                  (1.882)   

Educ_HSGrad         0.646   
                  (1.253)   

Educ_Bach          -2.305   
                  (1.707)   

teach1              0.155   
                  (0.111)   

teach2              0.034   
                  (0.023)   

System             -0.050   
                  (0.033)   

Nonprofit          -0.048   
                  (0.087)   

Profit              0.077   
                  (0.110)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000** 
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.001   
                  (0.027)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.133*  
                  (0.079)   

m_p_d               0.000   
                      (.)   

m_op                0.039   
                  (0.046)   

y2                  0.159***
                  (0.022)   

y3                  0.221***
                  (0.033)   

y4                  0.227***
                  (0.055)   

y5                  0.259***
                  (0.065)   

y6                  0.000   
                      (.)   
----------------------------
N                    1216   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~15   
----------------------------
1.pen_one           0.047*  
                  (0.029)   

1.fips_pow~2       -0.018   
                  (0.041)   

2.fips_pow~2        0.008   
                  (0.049)   

1.pen_one#~2       -0.003   
                  (0.029)   

1.pen_one#~2        0.009   
                  (0.029)   

1.pen_both          0.063   
                  (0.046)   

1.pen_both~2        0.041   
                  (0.038)   

1.pen_both~2        0.049   
                  (0.035)   

TotalPop            0.000   
                  (0.000)   

Age_18to34         -0.602   
                  (4.345)   

Age_35to64         -2.270   
                  (4.675)   

Age_65plus         -0.283   
                  (4.771)   

Race_White          1.778***
                  (0.653)   

Race_Black          2.859   
                  (2.340)   

Income_50~75       -6.462***
                  (2.486)   

Income_7~100       -2.726   
                  (2.416)   

Income_1~150       -2.166   
                  (2.151)   

Income_150~s        1.754   
                  (1.767)   

Educ_HSGrad         2.100   
                  (2.346)   

Educ_Bach           1.582   
                  (2.534)   

teach1             -0.030   
                  (0.052)   

teach2              0.023   
                  (0.020)   

System              0.013   
                  (0.043)   

Nonprofit          -0.118*  
                  (0.067)   

Profit             -0.062*  
                  (0.033)   

Labor_Nurse        -0.000   
                  (0.000)   

Labor_Other        -0.000***
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.061** 
                  (0.026)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother            0.000   
                      (.)   

m_p_d              -0.031   
                  (0.048)   

m_op               -0.042   
                  (0.033)   

y2                  0.205***
                  (0.021)   

y3                  0.235***
                  (0.034)   

y4                  0.158** 
                  (0.061)   

y5                  0.158** 
                  (0.072)   

y6                  0.000   
                      (.)   
----------------------------
N                    2065   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

----------------------------
                      (1)   
             lnprice_h~15   
----------------------------
pen_one             0.067***
                  (0.020)   

pen_both            0.104***
                  (0.030)   

ps2                 0.007   
                  (0.014)   

ps3                 0.028*  
                  (0.016)   

ps4                 0.027   
                  (0.020)   

ps_one2            -0.010   
                  (0.019)   

ps_one3            -0.030   
                  (0.019)   

ps_one4            -0.019   
                  (0.024)   

ps_both2           -0.028   
                  (0.024)   

ps_both3           -0.037   
                  (0.026)   

ps_both4           -0.011   
                  (0.036)   

1.fips_power       -0.001   
                  (0.028)   

2.fips_power       -0.005   
                  (0.038)   

2.fips_size        -0.026   
                  (0.031)   

TotalPop            0.000   
                  (0.000)   

Age_18to34         -2.998   
                  (3.125)   

Age_35to64         -5.190   
                  (3.541)   

Age_65plus         -3.872   
                  (2.926)   

Race_White          0.594   
                  (0.624)   

Race_Black         -2.786   
                  (1.858)   

Income_50~75       -1.867   
                  (1.306)   

Income_7~100       -0.878   
                  (1.209)   

Income_1~150       -4.775***
                  (1.171)   

Income_150~s        0.385   
                  (1.283)   

Educ_HSGrad         0.791   
                  (1.185)   

Educ_Bach          -0.975   
                  (1.544)   

teach1             -0.002   
                  (0.056)   

teach2              0.026*  
                  (0.015)   

System             -0.019   
                  (0.028)   

Nonprofit          -0.126***
                  (0.047)   

Profit             -0.026   
                  (0.045)   

Labor_Nurse         0.000   
                  (0.000)   

Labor_Other        -0.000***
                  (0.000)   

Beds                0.000   
                  (0.000)   

vbp_rebate          0.036*  
                  (0.019)   

m_census            0.000   
                      (.)   

m_sys               0.000   
                      (.)   

m_teach             0.000   
                      (.)   

m_hcahps            0.000   
                      (.)   

m_lnurse            0.000   
                      (.)   

m_lother           -0.178***
                  (0.044)   

m_p_d               0.001   
                  (0.053)   

m_op                0.003   
                  (0.028)   

y2                  0.205***
                  (0.015)   

y3                  0.260***
                  (0.022)   

y4                  0.224***
                  (0.040)   

y5                  0.249***
                  (0.047)   

y6                  0.000   
                      (.)   
----------------------------
N                    3305   
----------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. capture log close
